[
  {
    "id": "npc_001",
    "name": "Old Man Flynn",
    "greeting": "OLD MAN FLYNN: Did you know They Know?",
    "options": [
      {
        "text": "'Yes sir, I did.'",
        "result": "item",
        "details": "shield",
        "responseText": "OLD MAN FLYNN: I knew it! I knew someone would know! That brace looks like it needs a fair polishing. Let me give it a fair polishing, my son."
      },
      {
        "text": "Ignore him and walk away",
        "result": "none",
        "responseText": "You nod politely and keep moving. They continue to know."
      },
      {
        "text": "'What do you mean?'",
        "result": "none",
        "responseText": "OLD MAN FLYNN: You... don't know? Then I have nothing to discuss with you."
      },
      {
        "text": "'From what I heard, they do NOT know, actually.'",
        "result": "damage-minor",
        "responseText": "Old Man Flynn uses his cane to bop you on the head. He then walks away."
      }
    ]
  },
  {
    "id": "npc_002",
    "name": "Smith the Blacksmith",
    "greeting": "SMITH THE BLACKSMITH: Hello.",
    "options": [
      {
        "text": "'Howdy'",
        "result": "item",
        "details": "shield",
        "responseText": "SMITH THE BLACKSMITH: You can see me?! No one has talked to me or looked at me in 50 years. Oh heavens this is incredible. I spend my days and nights sleeping and tending to various pieces of armor. All day. All Night. You have given me hope. Here, take this bracer. Its my best yet."
      },
      {
        "text": "'Hello?'",
        "result": "none",
        "responseText": "SMITH THE BLACKSMITH: Howdy."
      },
      {
        "text": "'Hello.'",
        "result": "none",
        "responseText": "SMITH THE BLACKSMITH: Howdy."
      },
      {
        "text": "'Hi.'",
        "result": "none",
        "responseText": "SMITH THE BLACKSMITH: Howdy."
      }
    ]
  },
  {
    "id": "npc_003",
    "name": "Old Guy Accardi",
    "greeting": "OLD GUY ACCARDI: Have you seen my dog? His name is Artie. Honestly, he’ll eat any food. He even eats the tops of strawberries. Also, he likes two clicks at the same time.",
    "options": [
      {
        "text": "'I have not seen him, but if I do, I'll run back here and let you know.'",
        "result": "inventoryItem",
        "id": "health_potion_consumable",
        "responseText": "OLD GUY ACCARDI: That's what's up. Thanks for telling me. As a reward, here is a sealed Health Potion I found earlier."
      },
      {
        "text": "Ignore him and walk away",
        "result": "none",
        "responseText": "You nod politely and keep moving. You feel guilt because you DID in fact see Artie a few clicks ago. I hope you lose sleep."
      },
      {
        "text": "More like Fartie, heh.",
        "result": "combat",
        "responseText": "Old Guy Accardi's smile turns to a deep and angry scowl. He says, 'You're going to eat those words,' makes a ton of noise to attract unwanted attention, and then throws a smoke bomb at his feet. He is now gone and in his place is something ready to kill you."
      },
      {
        "text": "'Yes. I saw him a few clicks back that way. Gave him a couple of pets on the noggin, I did.'",
        "result": "item",
        "details": "gold",
        "amount": 15,
        "responseText": "OLD GUY ACCARDI: That's what's up. Thank you for looking out. Here is a finder's fee."
      }
    ]
  },
  {
    "id": "npc_004",
    "name": "TJ the Golden",
    "greeting": "TJ THE GOLDEN: Take a seat, will ya? I am cracking beers and listening to Steely Dan.",
    "options": [
      {
        "text": "Take a seat, crack a beer, and listen to Steely Dan",
        "result": "item",
        "details": "beer-health",
        "responseText": "Your mind and body are restored by a father's kindness and you gain +5 HP, and your vision is blurry from the delicious beer."
      },
      {
        "text": "'No thanks, I only like to Imagine the Dragon I am going to fight later.'",
        "result": "none",
        "responseText": "TJ THE GOLDEN: Alright. Suit yourself, padre."
      },
      {
        "text": "'No thanks, I have no time to learn the saxophone.'",
        "result": "none",
        "responseText": "TJ THE GOLDEN: They got a name for the winners in the world. I hope you have a name for when you lose."
      },
      {
        "text": "'Hell yeah I'd have a beer.'",
        "result": "item",
        "details": "beer-health",
        "responseText": "Your mind and body are restored by a father's kindness and you gain +5 HP, and your vision is blurry from the delicious beer."
      }
    ]
  },
  {
    "id": "npc_005",
    "name": "Fairwyn the Tongueless",
    "greeting": "FAIRWYN THE TONGUELESS: Oouu eeeahh ouu! Eerrr eh ah eehahee!!!",
    "options": [
      {
        "text": "'Did you say 'Look behind you, there is an enemy?'",
        "result": "combat",
        "responseText": "There was, in fact, an enemy behind you."
      },
      {
        "text": "'Out of the way, peck!'",
        "result": "damage",
        "responseText": "You should have listened. An enemy appears, hits you with its claws, and runs away. You take damage."
      },
      {
        "text": "'What?'",
        "result": "damage",
        "responseText": "You should have listened. An enemy appears, hits you with its claws, and runs away. You take damage."
      },
      {
        "text": "'I believe you with all of my soul even if I didn't understand what you said.'",
        "result": "item",
        "details": "health",
        "responseText": "You must have rested well last night because you knew what he meant before his tongueless mouth started flapping. You take your weapon and dig it into the enemy's skull, immediately dropping it back into the hell it came from, and you gain +5 HP."
      }
    ]
  },
  {
    "id": "npc_006",
    "name": "Evil Tom",
    "greeting": "EVIL TOM: My name is Evil Tom. I'm a really nice guy. 😃",
    "options": [
      {
        "text": "'I don't believe you, Evil Tom.'",
        "result": "combat",
        "responseText": "EVIL TOM: Well, I never!"
      },
      {
        "text": "'Right on.'",
        "result": "damage",
        "responseText": "Evil Tom sneezes and vanishes in a puff of smoke, leaving only a pair of old Crocs. The Crocs hurt to look at and deal 5 damage."
      },
      {
        "text": "'For sure.'",
        "result": "damage",
        "responseText": "Evil Tom coughs so hard he accidentally punches you in the face and you take 5 damage."
      },
      {
        "text": "'You should change your name to Nice Tom then.'",
        "result": "item",
        "details": "health",
        "responseText": "EVIL TOM: Thank you. There is a lack of kindness in this world, and it's nice to meet someone who is counter to the culture. Here is some fresh bread."
      }
    ]
  },
  {
    "id": "npc_007",
    "name": "Suttree The Old Mage",
    "greeting": "SUTTREE THE OLD MAGE: You look tired, traveler. Care for some arcane tea?",
    "options": [
      {
        "text": "Accept the tea",
        "responseText": "You feel energy surging through your veins.",
        "result": "special",
        "details": "recover",
        "amount": 1
      },
      {
        "text": "Decline politely",
        "responseText": "You nod respectfully and continue on your way.",
        "result": "none"
      },
      {
        "text": "Decline rudely",
        "responseText": "You nod disrespectfully and continue on your way.",
        "result": "none"
      },
      {
        "text": "Out of distrust of the world you live in, punch the Old Mage in the face.",
        "result": "damage-minor",
        "responseText": "The Mage doesn't seem to move or appear affected by your attack. However, your fist now aches. You move on awkwardly, losing -1 damage."
      }
    ]
  },
  {
    "id": "npc_008",
    "name": "Daniel the Map Seller",
    "greeting": "DANIEL THE MAP GIVER: I give maps. Not much else.",
    "options": [
      {
        "text": "Take a map from Daniel.",
        "responseText": "It appears the map contains a shortcut through the upcoming brush. Your click count is reduced by 3.",
        "result": "shortcut",
        "details": "clicks",
        "amount": 3
      },
      {
        "text": "'The only guidance I need is from the sun and the stars.'",
        "result": "none",
        "responseText": "DANIEL THE MAP SELLER: Cool."
      },
      {
        "text": "What about food?",
        "responseText": "DANIEL THE MAP SELLER: Just maps.",
        "result": "none"
      },
      {
        "text": "Give me that compass or else I will make you pay!",
        "responseText": "DANIEL THE MAP SELLER: Ok, geeze... Here you go, man. Relax.",
        "result": "inventoryItem",
        "id": "arcane_compass"
      }
    ]
  },
  {
    "id": "npc_009",
    "name": "The Lost Bartender",
    "greeting": "THE LOST BARTENDER: Howdy, sir. How has your journey been? Never mind, forget I asked. Asking a man a question is the biggest true form of weakness, and I have been known to be a strong guy. Here, have a rip of this swill, won't you? I also have knives and guns and bullets you can drink if you want to.",
    "options": [
      {
        "text": "Take a rip of the swill",
        "result": "item",
        "details": "health",
        "responseText": "Goes down smooth. Rips ya up on the inside in a good way."
      },
      {
        "text": "Drink the guns, knives, and bullets.",
        "result": "damage",
        "responseText": "THE LOST BARTENDER: Honestly, what did you expect? That's on you."
      },
      {
        "text": "Take the guns, knives, and bullets and duct tape them to your chainmail gloves.",
        "details": "shield",
        "responseText": "THE LOST BARTENDER: Very interesting."
      },
      {
        "text": "Politely decline.",
        "result": "none",
        "responseText": "THE LOST BARTENDER: Not even one knife? Okay then, pal."
      }
    ]
  },
  {
    "id": "npc_010",
    "name": "Ron Von Zarovich",
    "greeting": "RON VON ZAROVICH: Bobby Lasagna is not to be trusted. I would sooner trust Strahd Von Zarovich over Bobby L. She lives in a hut and she killed my friend who once turned into a T-Rex.",
    "options": [
      {
        "text": "'I am sorry for your loss.'",
        "result": "item",
        "details": "health",
        "responseText": "RON VON ZAROVICH: Wow... Is this loss?"
      },
      {
        "text": "'I could kill her for you.'",
        "details": "weapon",
        "responseText": "RON VON ZAROVICH: You could try. Here is some help. You'll end up vampire food, I fear. Good luck."
      },
      {
        "text": "'You shouldn't talk about your relations that way.'",
        "result": "none",
        "responseText": "RON VON ZAROVICH: You don't understand."
      },
      {
        "text": "'Well, if you think you are going to die, then maybe I can have your gold.'",
        "result": "item",
        "details": "gold",
        "amount": 15,
        "responseText": "RON VON ZAROVICH: Sure. What does it matter? These are the end times."
      }
    ]
  },
  {
    "id": "npc_011",
    "name": "Miss Riddlesworth",
    "greeting": "MISS RIDDLESWORTH: You see me once in a minute, twice in a moment, but never in a thousand years. What am I?",
    "options": [
      {
        "text": "'A blink'",
        "result": "none",
        "responseText": "MISS RIDDLESWORTH: Wrong!"
      },
      {
        "text": "'The letter M'",
        "result": "item",
        "details": "health",
        "responseText": "MISS RIDDLESWORTH: H- How did you guess?"
      },
      {
        "text": "'A memory'",
        "result": "none",
        "responseText": "MISS RIDDLESWORTH: Not a chance!"
      },
      {
        "text": "'The moon'",
        "result": "none",
        "responseText": "MISS RIDDLESWORTH: You could not be more incorrect."
      }
    ]
  },
  {
    "id": "npc_012",
    "name": "Mr Riddlesworth",
    "greeting": "MR RIDDLESWORTH: I build up castles, I tear down mountains. I make some men blind, I help others to see. What am I?",
    "options": [
      {
        "text": "'Time'",
        "result": "none",
        "responseText": "MR RIDDLESWORTH: Incorrect!"
      },
      {
        "text": "'Fire'",
        "result": "none",
        "responseText": "MR RIDDLESWORTH: Well, that's not the answer."
      },
      {
        "text": "'Sand'",
        "details": "weapon",
        "responseText": "MR RIDDLESWORTH: You got it!"
      },
      {
        "text": "'Gold'",
        "result": "none",
        "responseText": "MR RIDDLESWORTH: Wrong!"
      }
    ]
  },
  {
    "id": "npc_013",
    "name": "The Scroll Dealer",
    "greeting": "THE SCROLL DEALER: If you're tired of looking at the same rocks and trees, then I may have a scroll for you...",
    "options": [
      { "text": "Lonesome Doug", "routeTitle": "The_X-Files" },
      {
        "text": "No! Country For Old Men!",
        "routeTitle": "Response_to_sneezing"
      },
      {
        "text": "The Da Vinki Code",
        "routeTitle": "List_of_tautological_place_names"
      },
      { "text": "Gullible's Travels", "routeTitle": "Rabbit_Hash,_Kentucky" },
      {
        "text": "'No, thank you.'",
        "result": "none",
        "responseText": "THE SCROLL DEALER: Be careful out there..."
      }
    ]
  },
  {
    "id": "npc_014",
    "name": "Lord Bruenor Battlehammer",
    "greeting": "LORD BRUENOR BATTLEHAMMER: Good sir, I am Lord Bruenor Battlehammer, Lord of these lands and heir of King Bort Battlehammer. I confess I am lost. I understand being lost and a Lord of this land seems like something a crazy beggar would say, but I implore you, I am telling the truth! You seem like you know these lands better than most. Please, tell me which direction would be Castle Battlehammer?",
    "options": [
      {
        "text": "'My Lord, go past those bushes over there and through the clearing. You will be able to see your castle in the distance.'",
        "result": "inventoryItem",
        "id": "turkey_leg_consumable",
        "responseText": "LORD BRUENOR BATTLEHAMMER: Thank you, my dear friend. Here is a Turkey Leg from my finest Turkey. Come by any time and we can dine on a full Turkey!"
      },
      {
        "text": "'This path will lead you there safely. You will just have to head the other direction, My Lord.'",
        "responseText": "LORD BRUENOR BATTLEHAMMER: Thank you, my dear friend. Come visit me anytime and I will show you how to harness the power of your highest ability!",
        "result": "special",
        "details": "recover",
        "amount": 1
      },
      {
        "text": "'These things happen, My Lord. However, I seem to be just as lost as you are, sadly.'",
        "result": "item",
        "details": "weapon",
        "responseText": "LORD BRUENOR BATTLEHAMMER: Thank you, my dear friend. Come visit me anytime and we will improve that sword of yours!"
      },
      {
        "text": "You distrust the raving madman. Why would a Lord of the lands be lost? You decide to attack the lunatic with your weapon.",
        "routeTitle": "Prison",
        "responseText": "It seems he was telling the truth. Off to jail you go, I suppose."
      }
    ]
  },
  {
    "id": "npc_015",
    "name": "The Lighthouse Tavern",
    "greeting": "Just ahead, you spot a one-story building with what looks like a tall structure built to the left. The structure resembles a lighthouse. There is a handmade sign attached to the structure that says 'The Lighthouse Tavern'. You infer the tall structure is where this place got its name. Walking into the bar, there are a few patrons: a farmhand, a dwarf, and a mysterious man sitting in the shadows. The barkeep smiles at you. The bartender appears to be selling Beer and Boiled Peanuts. As you approach the bar, the mysterious man appears to also have something for sale...",
    "options": [
      {
        "text": "Buy a beer from the Barkeep (10 Gold)",
        "responseText": "'I'll take a Beer, please.'.",
        "result": "item",
        "details": "beer-cost-blur",
        "amount": 4,
        "goldCost": 5,
        "healthAmount": 10
      },
      {
        "text": "Buy Hardtack (5 Gold)",
        "responseText": "I'll take a Hardtack, please.",
        "result": "item",
        "details": "health-gold-loss",
        "healthAmount": 10,
        "goldCost": 5
      },
      {
        "text": "Buy the mysterious item from the Mysterious Man",
        "responseText": "The item looks like a normal compass, except it's glowing slightly. You walk outside with the compass, and without warning, you are transported to another area.",
        "result": "inventoryItem",
        "id": "arcane_compass"
      },
      {
        "text": "Leave",
        "responseText": "THE BARKEEP: Be careful of the goblins on this road, traveler.",
        "result": "none"
      }
    ]
  },
  {
    "id": "npc_016",
    "name": "A Cute Dog",
    "greeting": "'woof'",
    "options": [
      {
        "text": "'Hey I think a guy is looking for you.'",
        "result": "combat",
        "responseText": "The dog doesn't appear to be a dog after all and morphs into a disgusting creature."
      },
      {
        "text": "'Woof' back at ya.",
        "result": "combat",
        "responseText": "The dog doesn't appear to be a dog after all and morphs into a disgusting creature."
      },
      {
        "text": "More like Fartie, heh.",
        "result": "combat",
        "responseText": "The dog doesn't appear to be a dog after all and morphs into a disgusting creature."
      },
      {
        "text": "Attack the dog",
        "result": "inventoryItem",
        "id": "turkey_leg_consumable",
        "responseText": "You must have smelled something fishy because the dog was an enemy in disguise. The 'dog' dies immediately and drops a Turkey Leg, for some reason."
      }
    ]
  },
    {
    "id": "npc_017",
    "name": "Dead Body",
    "greeting": "In front of you, there is a dead body. You recognize the person as Dr. Agula, a doctor from your village. Dr. Agula does not appear to have decayed much which indicates this may have happened recently. You hear about witches in this area and wonder if thats what did him in. The Doctor is out, it seems.",
    "options": [
      {
        "text": "Take the Doctors Padded Armor",
        "result": "item",
        "details": "shield",
        "responseText": "You take the dead man's Padded Armor"
      },
      {
        "text": "Take the Doctors Gold",
        "result": "item",
        "details": "gold",
        "amount": 19,
        "responseText": "You take the dead man's gold."
      },
      {
        "text": "Dig through some ditches and bury the Doctor. Say a prayer, swear you will burn through whatever witches did this to the Doctor and move on.",
        "result": "none",
        "responseText": "'Rest in Peace, Rob Agula.'"
      },
      {
        "text": "'Hello'",
        "result": "none",
        "responseText": "Nothing Happens because its a dead body."
      }
    ]
  }
]