[
  {
    "id": "npc_001",
    "name": "Old Man Flynn",
    "greeting": "OLD MAN FLYNN: Did you know They Know?",
    "options": [
      {
        "text": "'Yes sir, I did.'",
        "result": "item",
        "details": "shield",
        "responseText": "OLD MAN FLYNN: I knew it. I knew someone would know. That brace looks like it needs a fair polishing. Let me give it a fair polishing, my son."
      },
      {
        "text": "Ignore him and walk away",
        "result": "none",
        "responseText": "You nod politely and keep moving. They continue to know."
      },
      {
        "text": "'What do you mean?'",
        "result": "none",
        "responseText": "OLD MAN FLYNN: You... don't know? Then I have nothing to discuss with you."
      },
      {
        "text": "'From what I heard, they do NOT know, actually.'",
        "result": "damage-minor",
        "responseText": "Old Man Flynn uses his cane to bop you on the head. He then walks away."
      }
    ]
  },
  {
    "id": "npc_002",
    "name": "Smith the Blacksmith",
    "greeting": "SMITH THE BLACKSMITH: Hello.",
    "options": [
      {
        "text": "'Howdy'",
        "result": "item",
        "details": "shield",
        "responseText": "SMITH THE BLACKSMITH: You can see me?. No one has talked to me or looked at me in 50 years. Oh heavens this is incredible. I spend my days and nights sleeping and tending to various pieces of armor. All day. All Night. You have given me hope. Here, take this bracer. Its my best yet."
      },
      {
        "text": "'Hello?'",
        "result": "none",
        "responseText": "SMITH THE BLACKSMITH: Howdy."
      },
      {
        "text": "'Hello.'",
        "result": "none",
        "responseText": "SMITH THE BLACKSMITH: Howdy."
      },
      {
        "text": "'Hi.'",
        "result": "none",
        "responseText": "SMITH THE BLACKSMITH: Howdy."
      }
    ]
  },
  {
    "id": "npc_003",
    "name": "Old Guy Accardi",
    "greeting": "OLD GUY ACCARDI: Have you seen my dog? His name is Artie. Honestly, he’ll eat any food. He even eats the tops of strawberries. Also, he likes two clicks at the same time.",
    "options": [
      {
        "text": "'I have not seen him, but if I do, I'll run back here and let you know.'",
        "result": "inventoryItem",
        "id": "health_potion_consumable",
        "responseText": "OLD GUY ACCARDI: That's what's up. Thanks for telling me. As a reward, here is a sealed Health Potion I found earlier."
      },
      {
        "text": "Ignore him and walk away",
        "result": "none",
        "responseText": "You nod politely and keep moving. You feel guilt because you DID in fact see Artie a few clicks ago. I hope you lose sleep."
      },
      {
        "text": "More like Fartie, heh.",
        "result": "combat",
        "responseText": "Old Guy Accardi's smile turns to a deep and angry scowl. He says, 'You're going to eat those words,' makes a ton of noise to attract unwanted attention, and then throws a smoke bomb at his feet. He is now gone and in his place is something ready to kill you."
      },
      {
        "text": "'Yes. I saw him a few clicks back that way. Gave him a couple of pets on the noggin, I did.'",
        "effect": "item",
        "details": "gold",
        "amount": 15,
        "responseText": "OLD GUY ACCARDI: That's what's up. Thank you for looking out. Here is a finder's fee."
      }
    ]
  },
  {
    "id": "npc_004",
    "name": "TJ the Golden",
    "greeting": "TJ THE GOLDEN: Take a seat, will ya? I am cracking beers and listening to Steely Dan.",
    "options": [
      {
        "text": "Take a seat, crack a beer, and listen to Steely Dan",
        "result": "item",
        "details": "beer-health",
        "responseText": "Your mind and body are restored by a father's kindness and you gain +5 HP, and your vision is blurry from the delicious beer."
      },
      {
        "text": "'No thanks, I only like to Imagine the Dragon I am going to fight later.'",
        "result": "none",
        "responseText": "TJ THE GOLDEN: Alright. Suit yourself, padre."
      },
      {
        "text": "'No thanks, I have no time to learn the saxophone.'",
        "result": "none",
        "responseText": "TJ THE GOLDEN: They got a name for the winners in the world. I hope you have a name for when you lose."
      },
      {
        "text": "'Hell yeah I'd have a beer.'",
        "result": "item",
        "details": "beer-health",
        "responseText": "Your mind and body are restored by a father's kindness and you gain +5 HP, and your vision is blurry from the delicious beer."
      }
    ]
  },
  {
    "id": "npc_005",
    "name": "Fairwyn the Tongueless",
    "greeting": "FAIRWYN THE TONGUELESS: Oouu eeeahh ouu. Eerrr eh ah eehahee...",
    "options": [
      {
        "text": "'Did you say 'Look behind you, there is an enemy?'",
        "result": "combat",
        "responseText": "There was, in fact, an enemy behind you."
      },
      {
        "text": "'Out of the way, peck.'",
        "result": "damage",
        "responseText": "You should have listened. An enemy appears, hits you with its claws, and runs away. You take damage."
      },
      {
        "text": "'What?'",
        "result": "damage",
        "responseText": "You should have listened. An enemy appears, hits you with its claws, and runs away. You take damage."
      },
      {
        "text": "'I believe you with all of my soul even if I didn't understand what you said.'",
        "result": "item",
        "details": "health",
        "responseText": "You must have rested well last night because you knew what he meant before his tongueless mouth started flapping. You take your weapon and dig it into the enemy's skull, immediately dropping it back into the hell it came from, and you gain +5 HP."
      }
    ]
  },
  {
    "id": "npc_006",
    "name": "Evil Tom",
    "greeting": "EVIL TOM: My name is Evil Tom. I'm a really nice guy. 😃",
    "options": [
      {
        "text": "'I don't believe you, Evil Tom.'",
        "result": "combat",
        "responseText": "EVIL TOM: Well, I never."
      },
      {
        "text": "'Right on.'",
        "result": "damage",
        "responseText": "Evil Tom sneezes and vanishes in a puff of smoke, leaving only a pair of old Crocs. The Crocs hurt to look at and deal 5 damage."
      },
      {
        "text": "'For sure.'",
        "result": "damage",
        "responseText": "Evil Tom coughs so hard he accidentally punches you in the face and you take 5 damage."
      },
      {
        "text": "'You should change your name to Nice Tom then.'",
        "result": "item",
        "details": "health",
        "responseText": "EVIL TOM: Thank you. There is a lack of kindness in this world, and it's nice to meet someone who is counter to the culture. Here is some fresh bread."
      }
    ]
  },
  {
    "id": "npc_007",
    "name": "Suttree The Old Mage",
    "greeting": "SUTTREE THE OLD MAGE: You look tired, traveler. Care for some arcane tea?",
    "options": [
      {
        "text": "Accept the tea",
        "responseText": "You feel energy surging through your veins.",
        "result": "special",
        "details": "recover",
        "amount": 1
      },
      {
        "text": "Decline politely",
        "responseText": "You nod respectfully and continue on your way.",
        "result": "none"
      },
      {
        "text": "Decline rudely",
        "responseText": "You nod disrespectfully and continue on your way.",
        "result": "none"
      },
      {
        "text": "Out of distrust of the world you live in, punch the Old Mage in the face.",
        "result": "damage-minor",
        "responseText": "The Mage doesn't seem to move or appear affected by your attack. However, your fist now aches. You move on awkwardly, losing -1 damage."
      }
    ]
  },
  {
    "id": "npc_008",
    "name": "Daniel the Map Seller",
    "greeting": "DANIEL THE MAP GIVER: I give maps. Not much else.",
    "options": [
      {
        "text": "Take a map from Daniel.",
        "responseText": "It appears the map contains a shortcut through the upcoming brush. Your click count is reduced by 3.",
        "result": "shortcut",
        "details": "clicks",
        "amount": 3
      },
      {
        "text": "'The only guidance I need is from the sun and the stars.'",
        "result": "none",
        "responseText": "DANIEL THE MAP SELLER: Cool."
      },
      {
        "text": "What about food?",
        "responseText": "DANIEL THE MAP SELLER: Just maps.",
        "result": "none"
      },
      {
        "text": "Give me that compass or else I will make you pay.",
        "responseText": "DANIEL THE MAP SELLER: Ok, geeze... Here you go, man. Relax.",
        "result": "inventoryItem",
        "id": "arcane_compass"
      }
    ]
  },
  {
    "id": "npc_009",
    "name": "The Lost Bartender",
    "greeting": "THE LOST BARTENDER: Howdy, sir. How has your journey been? Never mind, forget I asked. Asking a man a question is the biggest true form of weakness, and I have been known to be a strong guy. Here, have a rip of this swill, won't you? I also have knives and guns and bullets you can drink if you want to.",
    "options": [
      {
        "text": "Take a rip of the swill",
        "result": "item",
        "details": "health",
        "responseText": "Goes down smooth. Rips ya up on the inside in a good way."
      },
      {
        "text": "Drink the guns, knives, and bullets.",
        "result": "damage",
        "responseText": "THE LOST BARTENDER: Honestly, what did you expect? That's on you."
      },
      {
        "text": "Take the guns, knives, and bullets and duct tape them to your chainmail gloves.",
        "result": "item",
        "details": "shield",
        "responseText": "THE LOST BARTENDER: Very interesting."
      },
      {
        "text": "Politely decline.",
        "result": "none",
        "responseText": "THE LOST BARTENDER: Not even one knife? Okay then, pal."
      }
    ]
  },
  {
    "id": "npc_010",
    "name": "Ron Von Zarovich",
    "greeting": "RON VON ZAROVICH: Bobby Lasagna is not to be trusted. I would sooner trust Strahd Von Zarovich over Bobby L. She lives in a hut and she killed my friend Bulgresh who once turned into a T-Rex.",
    "dialogueNodes": {
      "start": {
        "text": "RON VON ZAROVICH: Bobby Lasagna is not to be trusted. I would sooner trust Strahd Von Zarovich over Bobby L. She lives in a hut and she killed my friend Bulgresh who once turned into a T-Rex.",
        "options": [
          {
            "text": "'I am sorry for your loss.'",
            "flow": "close_encounter",
            "result": "item",
            "details": "health",
            "responseText": "RON VON ZAROVICH: Wow... Is this loss?"
          },
          {
            "text": "'I could kill her for you.'",
            "flow": "dialogue_branch",
            "next_node_id": "kill_offer_confirmation"
          },
          {
            "text": "'You shouldn't talk about your relations that way.'",
            "flow": "close_encounter",
            "result": "none",
            "responseText": "RON VON ZAROVICH: You don't understand."
          },
          {
            "text": "'Well, if you think you are going to die, then maybe I can have your gold.'",
            "flow": "close_encounter",
            "effect": "item",
            "details": "gold",
            "amount": 15,
            "responseText": "RON VON ZAROVICH: Sure. What does it matter? These are the end times."
          }
        ]
      },
      "kill_offer_confirmation": {
        "text": "RON VON ZAROVICH: Are you sure? She is pretty dangerous...",
        "options": [
          {
            "text": "Yes. Bulgresh must be avenged. Tell me where she is and I will make her suffer.",
            "flow": "dialogue_branch",
            "next_node_id": "bobby_location"
          },
          {
            "text": "Actually, never mind. She sounds scary if she killed a T-Rex.",
            "flow": "close_encounter",
            "responseText": "RON VON ZAROVICH: As you wish. Perhaps it's for the best."
          }
        ]
      },
      "bobby_location": {
        "text": "RON VON ZAROVICH: She is through that pass, over where Berez used to stand, before it was flooded. Be careful, though... those lands are poisoned.",
        "options": [
          {
            "text": "Walk toward the pass.",
            "flow": "dialogue_branch",
            "next_node_id": "approach_pass"
          },
          {
            "text": "Actually, never mind.",
            "flow": "close_encounter",
            "responseText": "RON VON ZAROVICH: A wise choice. Perhaps some other time."
          }
        ]
      },
      "approach_pass": {
        "text": "You approach the pass. You see a small, green-colored stream. Steam rises and bubbles. The air seems to wobble and your nostrils sting.",
        "options": [
          {
            "text": "Walk through the stream.",
            "flow": "dialogue_branch",
            "effect": "damage-minor",
            "amount": 10,
            "responseText": "You wade through the sickly green stream, feeling a strange tingle as you lose 10 health points. The poisoned waters are already taking their toll.",
            "next_node_id": "approach_hut"
          },
          {
            "text": "Turn around and continue your adventure without facing Bobby Lasagna.",
            "flow": "close_encounter",
            "responseText": "You decide against braving the poisoned lands and turn back, seeking less perilous adventures."
          }
        ]
      },
      "approach_hut": {
        "text": "You approach a hut after walking for some time. The hut looks old and gnarled. There appears to be large footsteps all around the hut.",
        "options": [
          {
            "text": "Knock on the hut's door.",
            "result": "mini_boss_combat",
            "miniBossType": "Bobby Lasagna's Hut",
            "responseText": "The hut groans, grows legs right before your eyes and begins to attack. You are now in combat with a living, breathing hut."
          },
          {
            "text": "Search the area for Bobby.",
            "flow": "dialogue_branch",
            "effect": "damage-minor",
            "amount": 10,
            "responseText": "You meticulously search the overgrown surroundings, finding no immediate sign of Bobby. However, a hidden thorn bush snags your leg, dealing 10 damage.",
            "next_node_id": "rustling_bushes"
          },
          {
            "text": "Yell 'Hey Bobby. I'm ready to avenge Bulgresh.'",
            "result": "mini_boss_combat",
            "miniBossType": "Bobby Lasagna",
            "responseText": "Your voice echoes through the silent woods. From the hut, a figure emerges. 'Bulgresh, you say? He had it coming. Prepare to join him.'"
          }
        ]
      },
      "rustling_bushes": {
        "text": "You hear rustling in the bushes nearby...",
        "options": [
          {
            "text": "Ready yourself for combat.",
            "result": "mini_boss_combat",
            "miniBossType": "Bobby Lasagna",
            "responseText": "You brace yourself. Bobby Lasagna bursts from the foliage, her eyes alight with fury. 'So, you've come to meddle, have you?' Combat begins."
          },
          {
            "text": "Run.",
            "flow": "close_encounter",
            "responseText": "You decide discretion is the better part of valor and bolt, leaving the mysterious rustling and Bobby Lasagna's domain behind."
          }
        ]
      }
    }
  },
  {
    "id": "npc_011",
    "name": "Miss Riddlesworth",
    "greeting": "MISS RIDDLESWORTH: You see me once in a minute, twice in a moment, but never in a thousand years. What am I?",
    "options": [
      {
        "text": "'A blink'",
        "result": "none",
        "responseText": "MISS RIDDLESWORTH: Wrong."
      },
      {
        "text": "'The letter M'",
        "result": "item",
        "details": "health",
        "responseText": "MISS RIDDLESWORTH: H- How did you guess?"
      },
      {
        "text": "'A memory'",
        "result": "none",
        "responseText": "MISS RIDDLESWORTH: Not a chance."
      },
      {
        "text": "'The moon'",
        "result": "none",
        "responseText": "MISS RIDDLESWORTH: You could not be more incorrect."
      }
    ]
  },
  {
    "id": "npc_012",
    "name": "Mr Riddlesworth",
    "greeting": "MR RIDDLESWORTH: I build up castles, I tear down mountains. I make some men blind, I help others to see. What am I?",
    "options": [
      {
        "text": "'Time'",
        "result": "none",
        "responseText": "MR RIDDLESWORTH: Incorrect."
      },
      {
        "text": "'Fire'",
        "result": "none",
        "responseText": "MR RIDDLESWORTH: Well, that's not the answer."
      },
      {
        "text": "'Sand'",
        "result": "item",
        "details": "weapon",
        "responseText": "MR RIDDLESWORTH: You got it."
      },
      {
        "text": "'Gold'",
        "result": "none",
        "responseText": "MR RIDDLESWORTH: Wrong."
      }
    ]
  },
  {
    "id": "npc_013",
    "name": "The Scroll Dealer",
    "greeting": "THE SCROLL DEALER: If you're tired of looking at the same rocks and trees, then I may have a scroll for you...",
    "options": [
      { "text": "Lonesome Doug", "routeTitle": "The_X-Files" },
      {
        "text": "No. Country For Old Men.",
        "routeTitle": "Response_to_sneezing"
      },
      {
        "text": "The Da Vinki Code",
        "routeTitle": "List_of_tautological_place_names"
      },
      { "text": "Gullible's Travels", "routeTitle": "Rabbit_Hash,_Kentucky" },
      {
        "text": "'No, thank you.'",
        "result": "none",
        "responseText": "THE SCROLL DEALER: Be careful out there..."
      }
    ]
  },
  {
    "id": "npc_014",
    "name": "Lord Bruenor Battlehammer",
    "greeting": "LORD BRUENOR BATTLEHAMMER: Good sir, I am Lord Bruenor Battlehammer, Lord of these lands and heir of King Bort Battlehammer. I confess I am lost. I understand being lost and a Lord of this land seems like something a crazy beggar would say, but I implore you, I am telling the truth. You seem like you know these lands better than most. Please, tell me which direction would be Castle Battlehammer?",
    "options": [
      {
        "text": "'My Lord, go past those bushes over there and through the clearing. You will be able to see your castle in the distance.'",
        "result": "inventoryItem",
        "id": "turkey_leg_consumable",
        "responseText": "LORD BRUENOR BATTLEHAMMER: Thank you, my dear friend. Here is a Turkey Leg from my finest Turkey. Come by any time and we can dine on a full Turkey."
      },
      {
        "text": "'This path will lead you there safely. You will just have to head the other direction, My Lord.'",
        "responseText": "LORD BRUENOR BATTLEHAMMER: Thank you, my dear friend. Come visit me anytime and I will show you how to harness the power of your highest ability.",
        "result": "special",
        "details": "recover",
        "amount": 1
      },
      {
        "text": "'These things happen, My Lord. However, I seem to be just as lost as you are, sadly.'",
        "result": "item",
        "details": "weapon",
        "responseText": "LORD BRUENOR BATTLEHAMMER: Thank you, my dear friend. Come visit me anytime and we will improve that sword of yours."
      },
      {
        "text": "You distrust the raving madman. Why would a Lord of the lands be lost? You decide to attack the lunatic with your weapon.",
        "routeTitle": "Prison",
        "responseText": "It seems he was telling the truth. Off to jail you go, I suppose."
      }
    ]
  },
  {
    "id": "npc_015",
    "name": "The Lighthouse Tavern",
    "greeting": "Just ahead, you spot a one-story building with what looks like a tall structure built to the left. The structure resembles a lighthouse. There is a handmade sign attached to the structure that says 'The Lighthouse Tavern'. You infer the tall structure is where this place got its name. Walking into the bar, there are a few patrons: a farmhand, a dwarf, and a mysterious man sitting in the shadows. The barkeep smiles at you. The bartender appears to be selling Beer and Boiled Peanuts. As you approach the bar, the mysterious man appears to also have something for sale...",
    "options": [
      {
        "text": "Buy a beer from the Barkeep (10 Gold)",
        "responseText": "'I'll take a Beer, please.'.",
        "result": "item",
        "details": "beer-cost-blur",
        "amount": 4,
        "goldCost": 5,
        "healthAmount": 10
      },
      {
        "text": "Buy Hardtack (5 Gold)",
        "responseText": "I'll take a Hardtack, please.",
        "result": "item",
        "details": "health-gold-loss",
        "healthAmount": 10,
        "goldCost": 5
      },
      {
        "text": "Buy the mysterious item from the Mysterious Man",
        "responseText": "The item looks like a normal compass, except it's glowing slightly. You walk outside with the compass, and without warning, you are transported to another area.",
        "result": "inventoryItem",
        "id": "arcane_compass"
      },
      {
        "text": "Leave",
        "responseText": "THE BARKEEP: Be careful of the goblins on this road, traveler.",
        "result": "none"
      }
    ]
  },
  {
    "id": "npc_016",
    "name": "A Cute Dog",
    "greeting": "'woof'",
    "options": [
      {
        "text": "'Hey I think a guy is looking for you.'",
        "result": "combat",
        "responseText": "The dog doesn't appear to be a dog after all and morphs into a disgusting creature."
      },
      {
        "text": "'Woof' back at ya.",
        "result": "combat",
        "responseText": "The dog doesn't appear to be a dog after all and morphs into a disgusting creature."
      },
      {
        "text": "More like Fartie, heh.",
        "result": "combat",
        "responseText": "The dog doesn't appear to be a dog after all and morphs into a disgusting creature."
      },
      {
        "text": "Attack the dog",
        "result": "inventoryItem",
        "id": "turkey_leg_consumable",
        "responseText": "You must have smelled something fishy because the dog was an enemy in disguise. The 'dog' dies immediately and drops a Turkey Leg, for some reason."
      }
    ]
  },
  {
    "id": "npc_017",
    "name": "Dead Body",
    "greeting": "In front of you, there is a dead body. You recognize the person as Dr. Agula, a doctor from your village. Dr. Agula does not appear to have decayed much which indicates this may have happened recently. You hear about witches in this area and wonder if thats what did him in. The Doctor is out, it seems.",
    "options": [
      {
        "text": "Take the Doctors Padded Armor",
        "result": "item",
        "details": "shield",
        "responseText": "You take the dead man's Padded Armor"
      },
      {
        "text": "Take the Doctors Gold",
        "effect": "item",
        "details": "gold",
        "amount": 19,
        "responseText": "You take the dead man's gold."
      },
      {
        "text": "Dig through some ditches and bury the Doctor. Say a prayer, swear you will burn through whatever witches did this to the Doctor and move on.",
        "result": "none",
        "responseText": "'Rest in Peace, Rob Agula.'"
      },
      {
        "text": "'Hello'",
        "result": "none",
        "responseText": "Nothing Happens because its a dead body."
      }
    ]
  },
  {
    "id": "hanni_aebi",
    "name": "Hanni Aebi",
    "greeting": "New face in town, aren't you? My name's Hanni Aebi. Come, sit a spell, and tell me what brings you to our humble village.",
    "dialogueNodes": {
      "start": {
        "text": "New face in town, aren't you? My name's Hanni Aebi. Come, sit a spell, and tell me what brings you to our humble village.",
        "options": [
          {
            "text": "Tell me about this village.",
            "flow": "dialogue_branch",
            "next_node_id": "village_backstory"
          },
          {
            "text": "I could use some healing.",
            "flow": "dialogue_branch",
            "next_node_id": "healing_offer"
          },
          {
            "text": "I'm fine, thank you. Just passing through.",
            "flow": "close_encounter",
            "responseText": "Hanni nods kindly. 'Safe travels then, dearie. May your path be clear.'"
          }
        ]
      },
      "village_backstory": {
        "text": "Oh, this village has seen many seasons. We're nestled right at the foot of the Whisperwind Peaks, you see. Long ago, they say ancient spirits dwelled there, protecting us from the creeping shadows of the Sunken City. It's quieter now, but the old ways linger. We will know the shadows are back if our young ones start disappearing. The shadows crave innocent minds. But so far, no missing children.",
        "options": [
          {
            "text": "Thats... great for you...",
            "flow": "dialogue_branch",
            "next_node_id": "sunken_city_lore"
          },
          {
            "text": "That's enough history for now. Can you help me?",
            "flow": "dialogue_branch",
            "next_node_id": "healing_offer"
          },
          {
            "text": "Thank you for the stories. I should go.",
            "flow": "close_encounter",
            "responseText": "Hanni smiles warmly. 'Anytime, dearie. Come back if you need a warm word or a helping hand.'"
          }
        ]
      },
      "sunken_city_lore": {
        "text": "The Sunken City... a tragic tale. It was once a grand kingdom, swallowed by the earth and sea in a single night. Some say it was a curse, others, a forgotten magic. Best not to dwell on such things too long; they tend to draw unwanted attention.",
        "options": [
          {
            "text": "That's enough history for now. Can you help me?",
            "flow": "dialogue_branch",
            "next_node_id": "village_backstory"
          },
          {
            "text": "I've heard enough. Goodbye.",
            "flow": "close_encounter",
            "responseText": "Hanni nods, her expression thoughtful. 'Indeed. Some stories are best left untold.'"
          }
        ]
      },
      "healing_offer": {
        "text": "Oh, you poor thing. You look a bit rough. I've got some remedies. What do you need?",
        "options": [
          {
            "text": "A quick pick-me-up. (Free +5 HP)",
            "effect": "item",
            "details": "health",
            "healthAmount": 5,
            "responseText": "Hanni presses a warm poultice into your hand. 'There, that should help with the aches. No charge, dearie.'",
            "flow": "close_encounter"
          },
          {
            "text": "Something stronger for 10 Gold. (+20 HP)",
            "effect": "item",
            "details": "health-gold-loss",
            "healthAmount": 20,
            "goldCost": 10,
            "responseText": "Hanni produces a small, glowing vial. 'This special brew will set you right. Just 10 gold, for my troubles.'",
            "flow": "close_encounter"
          },
          {
            "text": "Do you have any ale? (2 Gold, +15 HP)",
            "effect": "item",
            "details": "beer-cost-blur",
            "healthAmount": 15,
            "goldCost": 2,
            "amount": 4,
            "responseText": "Hanni chuckles, pulling out a tankard. 'Always got some homebrew for a parched throat. Just 2 gold, but it's strong stuff.'",
            "flow": "close_encounter"
          },
          {
            "text": "Never mind, I'm alright now.",
            "flow": "dialogue_branch",
            "next_node_id": "start"
          }
        ]
      }
    }
  },
  {
    "id": "mysterious_cave",
    "name": "The Mysterious Cave",
    "greeting": "A narrow opening, almost hidden by thick vines, leads into a dark cave. A faint, earthy smell wafts from within, along with a whisper of cool air.",
    "dialogueNodes": {
      "start": {
        "text": "A narrow opening, almost hidden by thick vines, leads into a dark cave. A faint, earthy smell wafts from within, along with a whisper of cool air.",
        "options": [
          {
            "text": "Venture inside cautiously.",
            "flow": "dialogue_branch",
            "next_node_id": "cave_entrance"
          },
          {
            "text": "Leave the cave undisturbed.",
            "flow": "close_encounter",
            "responseText": "You decide your journey is too important. You continue on."
          }
        ]
      },
      "cave_entrance": {
        "text": "The darkness inside is absolute, broken only by the drip of water. You can barely make out two paths ahead: one narrow and winding, the other wider and leading deeper.",
        "options": [
          {
            "text": "Take the narrow, winding path.",
            "flow": "dialogue_branch",
            "next_node_id": "narrow_path"
          },
          {
            "text": "Take the wider, deeper path.",
            "flow": "dialogue_branch",
            "next_node_id": "wide_path"
          },
          {
            "text": "This is too spooky. I'm leaving.",
            "flow": "close_encounter",
            "responseText": "The cave's eerie silence is too much. You carefully backtrack and exit the cave."
          }
        ]
      },
      "narrow_path": {
        "text": "You squeeze through a tight passage. The passage seems to become more and more narrow as you go on.",
        "options": [
          {
            "text": "Continue down the narrow passage.",
            "flow": "dialogue_branch",
            "next_node_id": "narrow_path_outcome"
          },
          {
            "text": "Give up and return to the entrance.",
            "flow": "dialogue_branch",
            "next_node_id": "cave_entrance"
          }
        ]
      },
      "narrow_path_outcome": {
        "text": "You manage to catch yourself and regroup.",
        "options": [
          {
            "text": "Continue exploring the narrow path.",
            "flow": "close_encounter",
            "responseText": "You proceed further, finding nothing else of note at the moment. The path eventually leads you out of the cave."
          },
          {
            "text": "Return to the main entrance.",
            "flow": "dialogue_branch",
            "next_node_id": "cave_entrance"
          }
        ]
      },
      "wide_path": {
        "text": "The wider path leads to a large cavern. In the center, a faint light flickers, revealing a strange altar.",
        "options": [
          {
            "text": "Investigate the altar.",
            "flow": "dialogue_branch",
            "next_node_id": "wide_path_outcome"
          },
          {
            "text": "Decide it's too dangerous and turn back.",
            "flow": "dialogue_branch",
            "next_node_id": "cave_entrance"
          }
        ]
      },
      "wide_path_outcome": {
        "text": "The alter glows, shakes and emits a heat that plucks every pore on your skin.",
        "options": [
          {
            "text": "Touch the alter.",
            "result": "mini_boss_combat",
            "miniBossType": "Mind Flayer Spawn",
            "responseText": "'You'll learn to regret touching my altar.'"
          },
          {
            "text": "'I don't want any part of this. I am outta here.'",
            "flow": "dialogue_branch",
            "next_node_id": "cave_entrance"
          }
        ]
      }
    }
  },
  {
    "id": "npc_018_drunken_dragon",
    "name": "The Drunken Dragon Inn",
    "greeting": "As you push open the heavy wooden door, the warm, boisterous air of 'The Drunken Dragon Inn' washes over you. Laughter, clinking tankards, and the murmur of countless conversations fill the room. Travelers and dock workers alike are gathered, sharing tales and drinks. The barkeep nods a greeting from behind a polished counter.",
    "dialogueNodes": {
      "start": {
        "text": "The Drunken Dragon Inn is a lively place. The smell of roasted meat and ale hangs heavy in the air. What's your pleasure?",
        "options": [
          {
            "text": "Order a hearty ale and find a quiet corner to listen.",
            "effect": "item",
            "details": "beer",
            "amount": 4,
            "healthAmount": 1,
            "responseText": "You enjoy a fine, free ale, the blur of the drink helping you relax as you soak in the atmosphere. You feel a little healthier. The night passes peacefully.",
            "flow": "close_encounter"
          },
          {
            "text": "Approach the rosy-cheeked dwarf at the end of the bar.",
            "flow": "dialogue_branch",
            "next_node_id": "talk_to_mornik"
          },
          {
            "text": "Leave the tavern. It's too loud for you.",
            "flow": "close_encounter",
            "responseText": "You prefer the quiet of the road. You slip out, leaving the merriment behind."
          }
        ]
      },
      "talk_to_mornik": {
        "text": "You sidle up to the dwarf, who looks up with a grin. 'Well, hello there, stranger. Name's Mornik Ironaxe. Care for a drink? On me.' He shoves a tankard of potent-smelling brew into your hand.",
        "options": [
          {
            "text": "Accept Mornik's drink.",
            "effect": "item",
            "details": "beer-health",
            "healthAmount": 1,
            "amount": 6,
            "responseText": "You take a long swig of the free ale. It's strong, but surprisingly refreshing, and you feel a little healthier. Mornik claps you on the back.",
            "flow": "dialogue_branch",
            "next_node_id": "mornik_conversation"
          },
          {
            "text": "Politely decline the drink.",
            "responseText": "Mornik shrugs. 'Suit yourself. More for me, then.' He goes back to his ale.",
            "flow": "close_encounter"
          }
        ]
      },
      "mornik_conversation": {
        "text": "Mornik, now a fast friend, launches into a series of wild tales about his mining days, interrupted only by more rounds of drinks. The night blurs into a haze of laughter and increasingly improbable stories. You feel your head getting heavy...",
        "options": [
          {
            "text": "Try to keep up with Mornik's drinking.",
            "effect": "beer",
            "amount": 10,
            "healthAmount": 1,
            "responseText": "You match Mornik drink for drink. The world spins, and the last thing you remember is a loud dwarf singing about a pickaxe. You feel a tiny bit healthier from all the free ale.",
            "flow": "dialogue_branch",
            "next_node_id": "wake_up_hangover"
          },
          {
            "text": "Ask Mornik about his life as a dwarf.",
            "flow": "dialogue_branch",
            "next_node_id": "mornik_life_start"
          },
          {
            "text": "Excuse yourself and try to find a room for the night.",
            "responseText": "You manage to stumble to a vacant room just before passing out. A rough but restful night.",
            "flow": "close_encounter"
          }
        ]
      },
      "mornik_life_start": {
        "text": "Mornik's eyes twinkle. 'Ah, me lad/lass, a dwarf's life is a simple one, full of rock, ale, and the occasional goblin skirmish. But there's more to it than that... What do ye wish to hear?'",
        "options": [
          {
            "text": "Tell me more about the rock and mining.",
            "flow": "dialogue_branch",
            "next_node_id": "mornik_rock_tales"
          },
          {
            "text": "What about the goblins and skirmishes?",
            "flow": "dialogue_branch",
            "next_node_id": "mornik_goblin_tales"
          },
          {
            "text": "Let's just drink.",
            "flow": "close_encounter",
            "responseText": "Mornik grins. 'Aye, a fine choice.'"
          },
          {
            "text": "I've heard enough for tonight.",
            "flow": "close_encounter",
            "responseText": "You bid Mornik farewell, feeling a little wiser."
          }
        ]
      },
      "mornik_rock_tales": {
        "text": "He recounts tales of deep delves, finding rare gems, and the echoes of ancient pickaxes. 'A good shield, that's what keeps ye safe in the dark. My old dwarven shield, it's seen many a scrape, but it's still sturdy.'",
        "options": [
          {
            "text": "I could use a good shield.",
            "effect": "item",
            "details": "shield",
            "amount": 1,
            "responseText": "Mornik grunts. 'Aye, take this old thing. It's seen a few scrapes, but it'll serve ye well.' You gain +1 Defense.",
            "flow": "dialogue_branch",
            "next_node_id": "wake_up_hangover"
          },
          {
            "text": "Fascinating. Any other tales?",
            "flow": "dialogue_branch",
            "next_node_id": "mornik_life_start"
          },
          {
            "text": "I've heard enough.",
            "flow": "close_encounter",
            "responseText": "You thank Mornik for his stories and head out."
          }
        ]
      },
      "mornik_goblin_tales": {
        "text": "Mornik's face darkens slightly as he speaks of cunning goblins and narrow escapes. 'Always keep yer wits about ye, and never trust a shiny object that ain't gold. They're tricksters, those green skins.'",
        "options": [
          {
            "text": "Any advice on dealing with them?",
            "effect": "special",
            "details": "recover",
            "amount": 1,
            "responseText": "Mornik shares a secret dwarven combat trick, restoring some of your special ability charges. You feel more prepared for the road ahead.",
            "flow": "close_encounter"
          },
          {
            "text": "Back to your life stories.",
            "flow": "dialogue_branch",
            "next_node_id": "mornik_life_start"
          },
          {
            "text": "I've heard enough.",
            "flow": "close_encounter",
            "responseText": "You thank Mornik for his stories and head out."
          }
        ]
      },
      "wake_up_hangover": {
        "text": "The morning sun is blinding. You groan, your head pounding like a blacksmith's hammer. You're not in a bed. You're lying on a pile of leaves, surrounded by trees. You're in the woods, and you have no idea how you got here. And you feel a bit worse for wear.",
        "effect": "damage-minor",
        "amount": 3,
        "responseText": "A truly epic hangover. You take 3 damage from the ordeal. The tavern is nowhere in sight.",
        "options": [
          {
            "text": "Continue on.",
            "flow": "close_encounter",
            "responseText": "You shake your head, trying to clear the fog, and stumble forward, leaving the mystery of last night behind."
          }
        ]
      }
    }
  },
  {
    "id": "npc_019_karaoke_contest",
    "name": "The Bard's Library Karaoke",
    "greeting": "You step into the grand hall of the Bard's Library, usually a place of quiet study, but tonight it's abuzz with an unusual energy. A makeshift stage is set up, and a sign reads: 'Tonight: Karaoke Contest.' The air vibrates with nervous excitement and off-key singing. A cheerful gnome gestures towards the stage. 'Care to try your hand, traveler? Tonight, we seek the finest rendition of 'Molly Malone'. Winner gets 100 Gold Pieces.'",
    "dialogueNodes": {
      "start": {
        "text":"You step into the grand hall of the Bard's Library, usually a place of quiet study, but tonight it's abuzz with an unusual energy. A makeshift stage is set up, and a sign reads: 'Tonight: Karaoke Contest.' The air vibrates with nervous excitement and off-key singing. A cheerful gnome gestures towards the stage. 'Care to try your hand, traveler? Tonight, we seek the finest rendition of 'Molly Malone'. Winner gets 100 Gold Pieces.'",
        "options": [
          {
            "text": "Sign up for the contest despite not knowing the song at all.",
            "flow": "dialogue_branch",
            "next_node_id": "pick_song"
          },
          {
            "text": "Decline. Singing isn't your forte.",
            "flow": "close_encounter",
            "responseText": "You politely decline, deciding to leave the stage to the more musically inclined. The library's usual quiet calls to you."
          },
          {
            "text": "Just listen to the other contestants.",
            "flow": "close_encounter",
            "responseText": "You find a comfortable spot and enjoy the spectacle, chuckling at some of the more enthusiastic, if untalented, performers."
          }
        ]
      },
      "pick_song": {
        "text": "The gnome directs you to the stage where some 50 patrons half drunk cheer. The small band in the corner begins the song as the crowd sings the first line 'In Dublin's fair city, Where the girls are so pretty, I first set my eyes on sweet Molly Malone' and they await for you to belt out the next line...",
        "options": [
          {
            "text": "Sing: 'As she wheeled her wheel-barrow, Through streets broad and narrow, Crying: Cockles and mussels, alive, alive, oh.",
            "flow": "dialogue_branch",
            "next_node_id": "line_1"
          },
          {
            "text": "Sing: 'As she ate a squirrel, Through streets full of barrels, Sighing: Rocks and muskrats, alive, alive, oh.'",
            "flow": "dialogue_branch",
            "next_node_id": "lose_contest"
          },
          {
            "text": "Dont sing and instead begin sweating and anxiously shaking.'",
            "flow": "dialogue_branch",
            "next_node_id": "lose_contest"
          }
        ]
      },
      "line_1": {
        "text": "The crowd begins clapping along moderately and singing along: 'Alive, alive, oh, Alive, alive, oh. Crying Cockles and mussels, alive, alive, oh.'",
        "options": [
          {
            "text": "Sing: 'She was a nice mother, But sure 'twas no father, For so were her brother and sister before'",
            "flow": "dialogue_branch",
            "next_node_id": "lose_contest"
          },
          {
            "text": "Sing: 'She was a fishmonger, But sure 'twas no wonder, For so were her father and mother before'",
            "flow": "dialogue_branch",
            "next_node_id": "line_2"
          },
          {
            "text": "Dont sing and instead vomit off stage left and run out of the Library.",
            "flow": "dialogue_branch",
            "next_node_id": "lose_contest"
          }
        ]
      },
      "line_2": {
        "text": "The crowd begins wildly singing back: 'And they each wheel'd their barrow, Through streets broad and narrow'",
        "options": [
          {
            "text": "Sing back to the crowd: 'Sighing: Rocks and muskrats, alive, alive, oh.'",
            "flow": "dialogue_branch",
            "next_node_id": "lose_contest"
          },
          {
            "text": "Sing back to the crowd: 'Crying Cockles and mussels alive, alive oh.'",
            "flow": "dialogue_branch",
            "next_node_id": "line_3"
          },
          {
            "text": "Sing: 'Molly Maloooone. Molly MaloooooooooOOoooooOoOone.'",
            "flow": "dialogue_branch",
            "next_node_id": "lose_contest"
          }
        ]
      },
      "line_3": {
        "text": "The crowd is out of control. The floor is being scuffed with the amount of feet scraping in rhythm and neighbors nearby are poking their heads in a sleepy eyed state as the crowd sings back to you 'She died of a fever and no one could save her. And that was the end of sweet Molly Malone.'.",
        "options": [
          {
            "text": "Sing: 'But her goat wheels her barrow, Through streets made of marrow, Crying Socks filled of muscle, alive, alive, oh.'",
            "flow": "dialogue_branch",
            "next_node_id": "lose_contest"
          },
          {
            "text": "Sing: 'Rest in Peace, Mollllyyy Maaaaloooooneee.'",
            "flow": "dialogue_branch",
            "next_node_id": "lose_contest"
          },
          {
            "text": "Sing: 'But her ghost wheels her barrow, Through streets broad and narrow, Crying, Cockles and mussels, alive, alive, oh.'",
            "flow": "dialogue_branch",
            "next_node_id": "win_contest"
          }
        ]
      },
      "win_contest": {
        "text": "The crowd is in a steady roar. The gnome is running toward you with a big pouch of gold. He is jumping up and down shouting 'You win. You Win. Here is your prize.'",
        "options": [
          {
            "text": "Accept your winnings.",
            "effect": "item",
            "details": "gold",
            "amount": 100,
            "responseText": "You receive a heavy pouch of 100 gleaming gold pieces. Your vocal cords might be sore, but your purse is certainly not, and you've earned the respect of the bards present.",
            "flow": "close_encounter"
          }
        ]
      },
      "lose_contest": {
        "text": "A collective groan rises from the audience. The gnome sighs. Better luck next time.",
        "options": [
          {
            "text": "Accept defeat and leave.",
            "flow": "close_encounter",
            "responseText": "Well, at least a Bandit wasn't swiping at me with a sword. I guess it wasn't all bad."
          }
        ]
      }
    }
  },
  {
    "id": "npc_020_fishing_lesson",
    "name": "Old Man Francis",
    "greeting": "Ahoy there. I'm Man Francis. Some people call me Old Man Francis. Kind of Rude if you ask me but if the Pince-nez fits. I don't really wear glasses but, anyway, How is your day?",
    "type": "npc",
    "dialogueNodes": {
      "start": {
        "text": "Ahoy there. I'm Man Francis. Some people call me Old Man Francis. Kind of Rude if you ask me but if the Pince-nez fits. I don't really wear glasses but, anyway, How is your day?",
        "options": [
          {
            "text": "Teach me how to fish, please.",
            "flow": "dialogue_branch",
            "next_node_id": "lesson_1"
          },
          {
            "text": "Can you just give me a fish for the day?",
            "flow": "close_encounter",
            "responseText": "Old Man Francis sighs. 'I haven't caught anything for the day. Here is some bark tea instead.'",
            "effect": "inventoryItem",
            "details": "barkTea"
          },
          {
            "text": "Sorry, I didn't mean to engage in this conversation. I have a world to save.",
            "flow": "close_encounter",
            "responseText": "Old Man Francis shrugs and turns back to the sea."
          }
        ]
      },
      "lesson_1": {
        "text": "'Oh yeah I can do that. First, you need a good spot. Not too deep, not too shallow. Got it?'",
        "options": [
          {
            "text": "Got it.",
            "flow": "dialogue_branch",
            "next_node_id": "lesson_2"
          },
          {
            "text": "This is too complicated. I give up.",
            "flow": "close_encounter",
            "responseText": "Old Man Francis sighs. 'Some folks just ain't cut out for it.'"
          }
        ]
      },
      "lesson_2": {
        "text": "'Next, the bait. Worms, crickets, maybe a shiny lure. Maybe even some goblin slime. Depends on what yer after. Understand?'",
        "options": [
          {
            "text": "Understood.",
            "flow": "dialogue_branch",
            "next_node_id": "lesson_3"
          },
          {
            "text": "I'm losing patience. I give up.",
            "flow": "close_encounter",
            "responseText": "Old Man Francis shakes his head. 'Patience is key, patience is key.'"
          }
        ]
      },
      "lesson_3": {
        "text": "'Then, the cast. A smooth, gentle flick of the wrist. Not too hard, not too soft. But not too not not hard or soft. Basically in the middle. Think you can do it?'",
        "options": [
          {
            "text": "I think so.",
            "flow": "dialogue_branch",
            "next_node_id": "lesson_4"
          },
          {
            "text": "This is harder than it looks. I give up.",
            "flow": "close_encounter",
            "responseText": "Old Man Francis chuckles. 'Practice makes perfect. Or in this case, practice makes a person give up.'"
          }
        ]
      },
      "lesson_4": {
        "text": "'Now, the waiting game. That's where most folks fail. Just watch for any action on the line or the bobber. Got the patience for it?'",
        "options": [
          {
            "text": "I can wait, I guess.",
            "flow": "dialogue_branch",
            "next_node_id": "lesson_5"
          },
          {
            "text": "This is boring. I give up.",
            "flow": "close_encounter",
            "responseText": "Old Man Francis yawns. 'Not everyone's built for the quiet life.'"
          }
        ]
      },
      "lesson_5": {
        "text": "'If you get a bite, you'll reel that son of a gun in confidently but with caution. Are you ready?'",
        "options": [
          {
            "text": "I am not sure I am rea-",
            "flow": "dialogue_branch",
            "next_node_id": "lesson_6"
          },
          {
            "text": "This is a lot of pressure. I give up.",
            "flow": "close_encounter",
            "responseText": "Old Man Francis sighs. 'The big ones always get away from the faint of heart.'"
          }
        ]
      },
      "lesson_6": {
        "text": "'The current, now. She's a tricky beast. Learn to cast with it, not against it. It'll take your bait right where the fish are hiding. Understand the flow?'",
        "options": [
          {
            "text": "I'm not sure I am following your logi-'",
            "flow": "dialogue_branch",
            "next_node_id": "lesson_7"
          },
          {
            "text": "This is getting too deep. I give up.",
            "flow": "close_encounter",
            "responseText": "Old Man Francis shakes his head. 'The river don't wait for no one.'"
          }
        ]
      },
      "lesson_7": {
        "text": "'Weather signs. A storm brewin', fish go deep. A gentle drizzle, they might come up. Look to the sky, and listen to the air. What do you see?'",
        "options": [
          {
            "text": "I see a lot of water and some clouds in the sky. I see you. I smell you, too.",
            "flow": "dialogue_branch",
            "next_node_id": "lesson_8"
          },
          {
            "text": "I'm not a weather wizard. I give up.",
            "flow": "close_encounter",
            "responseText": "Old Man Francis shrugs. 'Then ye'll be fishin' in the wrong storms.'"
          }
        ]
      },
      "lesson_8": {
        "text": "'The art of chumming. A little bit of food, scattered just so, can bring 'em right to you. Don't overdo it, though, or they'll be full. Got the knack?'",
        "options": [
          {
            "text": "The knack?",
            "flow": "dialogue_branch",
            "next_node_id": "lesson_9"
          },
          {
            "text": "I don't want to waste bait. I give up.",
            "flow": "close_encounter",
            "responseText": "Old Man Francis sighs. 'Sometimes you gotta give a little to get a lot.'"
          }
        ]
      },
      "lesson_9": {
        "text": "'Reading the water's surface. Ripples from a rising fish, bugs skittering... it all tells a story. Are you reading the water yet?'",
        "options": [
          {
            "text": "I don't much care for reading.",
            "flow": "dialogue_branch",
            "next_node_id": "lesson_10"
          },
          {
            "text": "It all looks the same to me. I give up.",
            "flow": "close_encounter",
            "responseText": "Old Man Francis nods. 'Not everyone sees the hidden tales.'"
          }
        ]
      },
      "lesson_10": {
        "text": "'It's important to understand the yank of the fish. Sometimes the fish will be a big ol' goofball and that means you have to put in what the fish is hitting you with. You have to feel it.",
        "options": [
          {
            "text": "I'll focus on the feel. Do you have any beer to go with this?",
            "flow": "dialogue_branch",
            "next_node_id": "lesson_11"
          },
          {
            "text": "My hands are numb. I give up.",
            "flow": "close_encounter",
            "responseText": "Old Man Francis chuckles. 'Then ye'll miss the subtle whispers.'"
          }
        ]
      },
      "lesson_11": {
        "text": "'I don't drink. Choosing your hook size. Too big, they won't bite. Too small, they'll get away. It's a delicate balance. Think you can pick the right one?'",
        "options": [
          {
            "text": "I'll pick carefully.",
            "flow": "dialogue_branch",
            "next_node_id": "lesson_12"
          },
          {
            "text": "This is too much detail. I give up.",
            "flow": "close_encounter",
            "responseText": "Old Man Francis shrugs. 'The details make the difference.'"
          }
        ]
      },
      "lesson_12": {
        "text": "'The art of the retrieve. Slow, steady, or wobbling? Depends on the fish, depends on the lure. Every retrieve tells a story. What's your story?'",
        "options": [
          {
            "text": "I'm on an adventure. What is your story?",
            "flow": "dialogue_branch",
            "next_node_id": "lesson_13"
          },
          {
            "text": "I'm just reeling. I give up.",
            "flow": "close_encounter",
            "responseText": "Old Man Francisr sighs. 'Then ye'll only catch the lazy ones.'"
          }
        ]
      },
      "lesson_13": {
        "text": "'I am a fisherman.'",
        "options": [
          {
            "text": "Oh, that's nice.",
            "flow": "dialogue_branch",
            "next_node_id": "lesson_14"
          },
          {
            "text": "I'm done. I give up.",
            "flow": "close_encounter",
            "responseText": "Old Man Francis nods. 'Some lessons are learned only through waiting and getting to know your fellow fisherman.'"
          }
        ]
      },
      "lesson_14": {
        "text": "'Anyway, the moon's phases. Some say a full moon brings the fish out, others say it drives 'em deep. It's a mystery, but one worth pondering. What do you think?'",
        "options": [
          {
            "text": "I could see a full moon doing something to a fish, I suppose.",
            "flow": "dialogue_branch",
            "next_node_id": "lesson_15"
          },
          {
            "text": "I'm not an astrologer. I give up.",
            "flow": "close_encounter",
            "responseText": "Old Man Francis chuckles. 'The sky holds many secrets, not just for fish.'"
          }
        ]
      },
      "lesson_15": {
        "text": "'Understanding the fish's natural habitat. Rocks, weeds, sunken logs... they all provide cover. Cast near 'em, but not in 'em.'",
        "options": [
          {
            "text": "You sure you don't drink?",
            "flow": "dialogue_branch",
            "next_node_id": "lesson_16"
          },
          {
            "text": "I keep getting snagged. I give up.",
            "flow": "close_encounter",
            "responseText": "Old Man Francis sighs. 'The best spots are often the trickiest.'"
          }
        ]
      },
      "lesson_16": {
        "text": "'Yes, I am sure. The sound of the water. A gentle lapping, a rushing stream... different sounds mean different things. Listen closely. What do you hear?'",
        "options": [
          {
            "text": "I hear you, to be quite honest.",
            "flow": "dialogue_branch",
            "next_node_id": "lesson_17"
          },
          {
            "text": "It's just noise to me. I give up.",
            "flow": "close_encounter",
            "responseText": "Old Man Francis shakes his head. 'The sea sings a song, if you listen.'"
          }
        ]
      },
      "lesson_17": {
        "text": "'The importance of camouflage. Your shadow, your bright clothes... they can spook the fish. Blend in with nature.'",
        "options": [
          {
            "text": "Got it. I won't wear my neon colored scarf while fishing.",
            "flow": "dialogue_branch",
            "next_node_id": "lesson_18"
          },
          {
            "text": "I like my bright clothes. I give up.",
            "flow": "close_encounter",
            "responseText": "Old Man Francis shrugs. 'Then you'll be seen, and the fish will flee.'"
          }
        ]
      },
      "lesson_18": {
        "text": "'Not to get too philosophic but this is what it's all about. The wash of the waves, the peaceful breeze, the potential fish to be caught, eating the bait when no one is looking...'",
        "options": [
          {
            "text": "Yeah, I get that.",
            "flow": "dialogue_branch",
            "next_node_id": "lesson_19"
          },
          {
            "text": "Eating bait is pretty gross. I give up.",
            "flow": "close_encounter",
            "responseText": "Old Man Francis sighs. 'Suit yourself.'"
          }
        ]
      },
      "lesson_19": {
        "text": "'Wait... I think you have something. I think you have something.'",
        "options": [
          {
            "text": "Reel in the fish using the lessons you have learned.",
            "flow": "dialogue_branch",
            "next_node_id": "lesson_20"
          },
          {
            "text": "Throw your fishing pole into the sea.",
            "flow": "close_encounter",
            "responseText": "Old Man Francis smiles sadly. 'Why did you do that?'"
          }
        ]
      },
      "lesson_20": {
        "text": "'You got it. Thats the biggest fish I have seen in a long while. I bet that fish ages well with age.'",
        "options": [
          {
            "text": "Receive the Fish of Eternal Enlightenment",
            "flow": "close_encounter",
            "effect": "inventoryItem",
            "details": "enlightenmentFish",
            "responseText": "You receive The Fish of Eternal Enlightenment. It shimmers with ancient power."
          }
        ]
      }
    }
  },
  {
    "id": "npc_020_kidnapped_encounter",
    "name": "The Fallen Tree",
    "greeting": "A quiet walk through the woods is shattered by a desperate scream for help. You follow the sound, finding a person pinned beneath a large, fallen tree. The person is struggling, their face a mask of pain. Their voice is weak, pleading for you to help them.",
    "dialogueNodes": {
      "start": {
        "text": "A quiet walk through the woods is shattered by a desperate scream for help. You follow the sound, finding a person pinned beneath a large, fallen tree. The person is struggling, their face a mask of pain. Their voice is weak, pleading for you to help them.",
        "options": [
          {
            "text": "Attempt to lift the tree off the person.",
            "flow": "dialogue_branch",
            "next_node_id": "kidnapped_start"
          },
          {
            "text": "Ask the person for their name.",
            "flow": "dialogue_branch",
            "next_node_id": "kidnapped_start"
          },
          {
            "text": "Steal the person's gold.",
            "flow": "dialogue_branch",
            "next_node_id": "kidnapped_start"
          },
          {
            "text": "Walk away as if you didn't hear anything at all.",
            "flow": "close_encounter",
            "responseText": "You turn and walk away, the scream fading behind you. Best not to get involved."
          }
        ]
      },
      "kidnapped_start": {
        "text": "As you get closer, you feel a sharp pain on the back of your head. The lights go out, and your consciousness drifts away.",
        "options": [
          {
            "text": "Drift into a dream.",
            "flow": "dialogue_branch",
            "next_node_id": "dream_sequence"
          }
        ]
      },
      "dream_sequence": {
        "text": "You dream of a time long ago, safe and sound at your parents' old peat-covered lakehouse. You are young again, chasing squirrels and helping your father chop wood by the shore. Everything is calm. You are safe. You are safe.",
        "options": [
          {
            "text": "Wake up from the dream.",
            "flow": "dialogue_branch",
            "next_node_id": "wakeup"
          }
        ]
      },
      "wakeup": {
        "text": "You wake up with a jolt, a dull ache throbbing in your head. You are tied to a chair with ropes in a dimly lit, underground bunker. A closed metal door sits opposite you. At a nearby table, a man is sitting, calmly cutting up an apple with a knife and eating the pieces.",
        "options": [
          {
            "text": "Attempt to stand up.",
            "flow": "dialogue_branch",
            "next_node_id": "wakeup_stand"
          },
          {
            "text": "Scream, 'Where am I?! Who are you?!'",
            "flow": "dialogue_branch",
            "next_node_id": "dialogue_route"
          },
          {
            "text": "Offer your gold to be released.",
            "flow": "dialogue_branch",
            "next_node_id": "wakeup_gold"
          },
          {
            "text": "Threaten to kill the man.",
            "flow": "dialogue_branch",
            "next_node_id": "choke_event"
          },
          {
            "text": "Say nothing and stare at the man.",
            "flow": "dialogue_branch",
            "next_node_id": "wakeup_stare"
          }
        ]
      },
      "wakeup_stand": {
        "text": "You strain against the ropes, attempting to stand, but the chair topples over. The man sighs, gets up, and without a word, rights the chair and you back up straight.",
        "options": [
          {
            "text": "Continue",
            "flow": "dialogue_branch",
            "next_node_id": "wakeup"
          }
        ]
      },
      "wakeup_gold": {
        "text": "The man doesn't even look up from his apple. 'Oh, don't worry,' he says, 'we plan on stealing everything from you no matter how this turns out.'",
        "options": [
          {
            "text": "Continue",
            "flow": "dialogue_branch",
            "next_node_id": "wakeup"
          }
        ]
      },
      "wakeup_stare": {
        "text": "You stare at the man. The man continues to stare at his apple, taking another bite.",
        "options": [
          {
            "text": "Continue",
            "flow": "dialogue_branch",
            "next_node_id": "wakeup"
          }
        ]
      },
      "dialogue_route": {
        "text": "The man stops cutting his apple, puts the knife on the table, and meets your gaze. 'Me? I'm nobody. You? You're a ransom toward a big payday.'",
        "options": [
          {
            "text": "'Ransom?! I'm nobody!'",
            "flow": "dialogue_branch",
            "next_node_id": "dialogue_route_2"
          },
          {
            "text": "'You'll pay for this!'",
            "flow": "dialogue_branch",
            "next_node_id": "dialogue_route_3"
          }
        ]
      },
      "dialogue_route_2": {
        "text": "'We have been following you,' he says, a small smile playing on his lips. 'We've seen you talk to Lords and Kings on your journey. You are definitely somebody.'",
        "options": [
          {
            "text": "Continue the encounter.",
            "flow": "dialogue_branch",
            "next_node_id": "wakeup"
          }
        ]
      },
      "dialogue_route_3": {
        "text": "'You mean your Kings and noblepeople will pay us for this?' he replies with a sneer.",
        "options": [
          {
            "text": "Continue the encounter.",
            "flow": "dialogue_branch",
            "next_node_id": "wakeup"
          }
        ]
      },
      "choke_event": {
        "text": "The man laughs, puts a piece of apple in his mouth, starts chewing, and stands up. He walks over to you, pointing the knife at your throat. With a mouth full of apple, he says, 'Yeah... very funny. I'm not the one tied u-' He suddenly starts choking, grabbing his throat. He falls down, flailing on the ground, and soon enough, the life leaves his body. His knife clatters to the floor.",
        "options": [
          {
            "text": "Fall on the ground near the knife to cut your ropes free.",
            "flow": "dialogue_branch",
            "next_node_id": "freedom_options"
          }
        ]
      },
      "freedom_options": {
        "text": "After a struggle, you manage to cut yourself free. You stand up, your legs still a little unsteady, and look around the bunker. The metal door is your only way out.",
        "options": [
          {
            "text": "Open the door.",
            "flow": "dialogue_branch",
            "next_node_id": "open_door"
          }
        ]
      },
      "open_door": {
        "text": "You open the metal door, revealing a small hallway. You can go left or right.",
        "options": [
          {
            "text": "Go left.",
            "flow": "dialogue_branch",
            "next_node_id": "go_left"
          },
          {
            "text": "Go right.",
            "flow": "dialogue_branch",
            "next_node_id": "go_right"
          }
        ]
      },
      "go_left": {
        "text": "You hear a loud clanking of ale glasses and loud, drunken voices through a closed door on the left.",
        "options": [
          {
            "text": "Kick the door down and get your revenge for ruining a nice day.",
            "result": "mini_boss_combat",
            "miniBossType": "Drunken Kidnappers",
            "responseText": "You smash the door off its hinges, revealing a room full of rowdy, startled kidnappers. They all turn to face you."
          },
          {
            "text": "Turn around and go right instead.",
            "flow": "dialogue_branch",
            "next_node_id": "go_right"
          }
        ]
      },
      "go_right": {
        "text": "You see a set of stairs leading up to a cellar door.",
        "options": [
          {
            "text": "Turn around and go the other way.",
            "flow": "dialogue_branch",
            "next_node_id": "go_left"
          },
          {
            "text": "Go through the cellar door.",
            "flow": "close_encounter",
            "responseText": "You carefully open the cellar door and slip outside, into the cool night air. You are free."
          }
        ]
      }
    }
  }
]
