[
  {
    "id": "lore_001",
    "text": "Etched into a cave wall: 'Beware the one-eyed owl who guards the dusk.'",
    "options": [
      {
        "text": "Poke the owl in the eye",
        "result": "combat",
        "responseText": "The owl's eye snaps open. There is a deep and gravelly growl coming from behind..."
      },
      {
        "text": "Keep walking",
        "result": "none",
        "responseText": "The forest remains silent."
      },
      {
        "text": "Kick the owl in the eye",
        "result": "combat",
        "responseText": "The owl's eye snaps open. There is a deep and gravelly growl coming from behind..."
      },
      {
        "text": "Step away slowly",
        "result": "none",
        "responseText": "The forest remains silent, but you feel the eye glaring at you."
      }
    ]
  },
  {
    "id": "lore_002",
    "text": "There is what looks like a deep, dark pit about 10 feet ahead of you. As you step closer, you can hear the sound of rustling.",
    "options": [
      {
        "text": "Jump in the hole. Fortune favors the bold.",
        "result": "combat",
        "responseText": "...and the bold favor the afterlife."
      },
      {
        "text": "Step around the pit.",
        "result": "none",
        "responseText": "It's too risky. I better keep moving."
      },
      {
        "text": "Demonstrate how dexterous you are by leaping over the pit",
        "result": "damage-minor",
        "responseText": "You jump the gap but land on your ankle and hurt yourself."
      },
      {
        "text": "Throw a rock into the pit.",
        "result": "combat",
        "responseText": "You hear the snarling intensify and see a creature climb up the pit. Before you know it, the creature is in front of you, looking deep into your eyes."
      }
    ]
  },
  {
    "id": "lore_003",
    "text": "There is a glowing herb sprouting from a crack in the rock.",
    "options": [
      {
        "text": "Pick it out of the crack and use it for a glowing herb stew",
        "result": "item",
        "details": "health",
        "responseText": "'This is very good and VERY minty stew.'"
      },
      {
        "text": "Eat it",
        "result": "item",
        "details": "health",
        "responseText": "The herb tastes minty and you gain +5 HP."
      },
      {
        "text": "Leave it alone",
        "result": "none",
        "responseText": "Maybe someone else will need it more."
      },
      {
        "text": "Curse at the glowing herb",
        "result": "none",
        "responseText": "Nothing happens. Do you feel tough?"
      }
    ]
  },
  {
    "id": "lore_004",
    "text": "You have reached a smooth rock overlooking the forest ahead.",
    "options": [
      {
        "text": "Sit at the rock and contemplate your journey so far and plan for the journey ahead.",
        "result": "special",
        "details": "recover",
        "responseText": "I wish I had a beer to crack and some Steely Dan to listen to, but this will do."
      },
      {
        "text": "Throw a middle finger at the rock",
        "result": "none",
        "responseText": "'What an ugly rock.'"
      },
      {
        "text": "Appreciate the rock for what it is and move on.",
        "result": "none",
        "responseText": "'I must continue on.'"
      },
      {
        "text": "Pray upon the rock and thank the Gods for safety and health",
        "result": "item",
        "details": "health",
        "responseText": "The sky grants temporary shade from the sun and you feel comforted."
      }
    ]
  },
  {
    "id": "lore_005",
    "text": "There is a large clearing in the forest that leads to a small lake where the sun's light dances endlessly. There is a small glowing artifact sticking out of the rocks and sand. It seems to shake harder the closer it is to a weapon...",
    "options": [
      {
        "text": "Pick it up and touch it to your weapon",
        "result": "item",
        "details": "weapon",
        "responseText": "The shaking stops, the weapon feels sturdier. Damage base has been increased by 1."
      },
      {
        "text": "Kick the rock into the lake",
        "result": "damage-minor",
        "responseText": "The rock, still shaking, sails into the lake and disappears under the water. Your foot took damage."
      },
      {
        "text": "Eat the rock",
        "result": "none",
        "responseText": "Your stomach shakes and shakes, but nothing substantial happens."
      },
      {
        "text": "Leave it alone",
        "result": "none",
        "responseText": "'I have no use for violently shaking rocks, to be quite honest.'"
      }
    ]
  },
  {
    "id": "lore_006",
    "text": "You find a pile of steel, an anvil, and a kiln all under a lean-to. It appears to be an old blacksmithing site that has since been abandoned. Everything under the lean-to seems to still be in working order.",
    "options": [
      {
        "text": "Use the things under the lean-to on your weapon.",
        "result": "item",
        "details": "weapon",
        "responseText": "I should have been a blacksmith instead of an adventurer. Damage base has been increased by 1."
      },
      {
        "text": "Continue on.",
        "result": "none",
        "responseText": "There are probably bugs and spiders in that mess. No thank you."
      },
      {
        "text": "Start a new town, start a new life.",
        "result": "none",
        "responseText": "You hang up your weapons, your boots, and your armor. You begin chopping trees one by one, create a lean-to against the biggest, closest tree you can find. By day, you chop trees, burn debris, rearrange rocks, and build on existing structures to reinforce their strength. At dusk, you find local game to sustain on: fish, deer, squirrel, wild boar. At night, you contemplate your next move. Should you start building a church to pray to your Gods? Should you start building a more sustainable home to live in? I bet down the road, a library and a general store would bring in people to your town. What should you name your town? Should you start a farm to prevent the local wildlife from dying out? You should get some sleep. Sleep would be good. You wake up on the 5th day. You decide none of this is worth it and move on in your journey."
      },
      {
        "text": "Eat some of the steel.",
        "result": "damage",
        "responseText": "Why?"
      }
    ]
  },
  {
    "id": "lore_007",
    "text": "You reach a vending machine with the branding 'Uncle Junior's Weapon Upgrades'. It appears it doesn't take any currency and just asks you to place your weapon on its shelf and press 'upgrade'.",
    "options": [
      {
        "text": "Place your weapon on the shelf and press 'upgrade'.",
        "result": "combat",
        "responseText": "Cazzata, Malanga!"
      },
      {
        "text": "Move forward without upgrading your weapon.",
        "result": "none",
        "responseText": "Nothing is free in this life. I'll pass."
      },
      {
        "text": "Check behind the vending machine for any other services it may or may not have.",
        "result": "none",
        "responseText": "There is nothing behind the vending machine."
      },
      {
        "text": "Press upgrade without placing your weapon on the shelf.",
        "result": "item",
        "details": "poison",
        "amount": 5,
        "damage": 2,
        "responseText": "The vending machine fires on and violently spits out a glass vial full of a green liquid. It shatters on your face. It appears to be poison."
      }
    ]
  },
  {
    "id": "lore_008",
    "text": "You come across a treasure chest. The lock appears to be busted.",
    "options": [
      {
        "text": "Open the chest",
        "responseText": "There appears to be gold in that there chest.",
        "result": "item",
        "details": "gold",
        "amount": 50
      },
      {
        "text": "Walk beyond it and continue on.",
        "responseText": "Doubtful there is anything in there if the lock is busted.",
        "result": "none"
      },
      {
        "text": "Admire the treasure chest from afar",
        "responseText": "'This is a nice treasure chest.'",
        "result": "none"
      },
      {
        "text": "Kick the treasure chest",
        "responseText": "Your foot hurts now.",
        "result": "damage-minor"
      }
    ]
  },
  {
    "id": "lore_009",
    "text": "You see a very large statue in a clearing. It appears to be thousands of years old. It is surrounded by ruined rock and structures that have seen better days. The statue appears to be in decent shape and has not succumbed to the elements. Approaching the statue, you can see a plaque. Written on the plaque is the following: 'To our leader in laughter, Norm. What is green and has wheels?' The plaque appears to ask a question.",
    "options": [
      {
        "text": "Respond with 'swords?'",
        "responseText": "Nothing happens.",
        "result": "none"
      },
      {
        "text": "Respond with 'rocks?'",
        "responseText": "Nothing happens.",
        "result": "none"
      },
      {
        "text": "Respond with 'clouds?'",
        "responseText": "Nothing happens.",
        "result": "none"
      },
      {
        "text": "Respond with 'grass?'",
        "responseText": "The statue slowly moves to the south, revealing an entryway to an underground path. Above the archway that leads into the path reads another plaque that says 'Grass. I lied about the wheels'. The path appears to be a shortcut through the forest.",
        "result": "shortcut",
        "details": "clicks",
        "amount": 6
      }
    ]
  },
  {
    "id": "lore_010",
    "text": "There is a sturdy bridge ahead of you. The bridge may be short, but it appears to be made up of squares. Each square a different color. The first four squares are colored Red, White, Green, and Blue. Each square has 'Currents murmur my name, the daylight wears my face, sorrow drapes itself in my hue, and I wait beneath your next footfall' written on them respectively.",
    "options": [
      {
        "text": "Step on the Green square",
        "result": "damage",
        "responseText": "The bridge shakes and crumbles beneath your feet. You fall into the ravine below and take -5 Damage."
      },
      {
        "text": "Step on the White square",
        "result": "damage",
        "responseText": "The bridge shakes and crumbles beneath your feet. You fall into the ravine below and take -5 Damage."
      },
      {
        "text": "Step on the Blue square",
        "responseText": "The Blue square lights up, then dims. Then all the squares turn blue. You walk across the bridge safely.",
        "result": "shortcut",
        "details": "clicks",
        "amount": 6
      },
      {
        "text": "Step on the Red square",
        "result": "damage",
        "responseText": "The bridge shakes and crumbles beneath your feet. You fall into the ravine below and take -5 Damage."
      }
    ]
  },
  {
    "id": "lore_011",
    "text": "There is a sturdy bridge ahead of you. The bridge may be short, but it appears to be made up of squares. These squares have arrows pointing North, South, East, and West. The squares have written on them 'You’ll want warmth upon the road to me, The faithful star holds my name, The sky stretches on with my voice, And I lie just ahead, beneath your next step.'",
    "options": [
      {
        "text": "Step on the North square",
        "responseText": "The North square lights up, then all 4 squares light up. Then they slowly dim and suddenly change into one large arrow pointing toward the end of the bridge allowing you to cross it safely.",
        "result": "shortcut",
        "details": "clicks",
        "amount": 10
      },
      {
        "text": "Step on the South square",
        "result": "damage",
        "responseText": "The bridge shakes and crumbles beneath your feet. You fall into the ravine below and take -5 Damage."
      },
      {
        "text": "Step on the East square",
        "result": "damage",
        "responseText": "The bridge shakes and crumbles beneath your feet. You fall into the ravine below and take -5 Damage."
      },
      {
        "text": "Step on the West square",
        "result": "damage",
        "responseText": "The bridge shakes and crumbles beneath your feet. You fall into the ravine below and take -5 Damage."
      }
    ]
  },
  {
    "id": "lore_012",
    "text": "There is a crate in front of you that appears to have a series of wires that loop around the outside and feed into the inside. A note sits beside the crate that says 'CAUTION: Do NOT cut the Red wire!'.",
    "options": [
      {
        "text": "Cut the Red Wire",
        "responseText": "The crate explodes and throws you back 50 feet. Following directions appears to be your weak suit.",
        "result": "damage-major"
      },
      {
        "text": "Cut the Green Wire",
        "result": "item",
        "details": "gold",
        "amount": 45,
        "responseText": "The crate whirs a low tone and then immediately opens up, all 4 sides collapsing to the ground. A pile of gold is revealed."
      },
      {
        "text": "Cut All of the Wires",
        "result": "damage-major",
        "responseText": "You cut the Blue Wire and nothing happens. You cut the Green Wire and the crate starts emitting a loud whirring sound. You panic and cut the Red Wire and the crate explodes and throws you back 50 feet. Impatience isn't a virtue."
      },
      {
        "text": "Cut the Blue Wire",
        "result": "none",
        "responseText": "Nothing happens."
      }
    ]
  },
  {
    "id": "lore_013",
    "text": "You come across a bubbling swamp. The steam from the swamp is apparent and the smell is sulfuric and strong. There does appear to be a way around, but if you cut through the swamp, you might get hurt. However, you will save some time.",
    "options": [
      {
        "text": "Walk carefully to the other side through the swamp.",
        "responseText": "You make it across, saving time but also taking some damage as well.",
        "result": "shortcut-damage",
        "details": "recover"
      },
      {
        "text": "Walk around the left side of the swamp",
        "result": "combat",
        "responseText": "There was an enemy waiting to ambush you on the left side."
      },
      {
        "text": "Walk around the right side of the swamp",
        "result": "item",
        "details": "gold",
        "amount": 30,
        "responseText": "You make it safely to the other side of the putrid swamp. While walking, you find a bag with 30 gold pieces in it."
      },
      {
        "text": "Take off all of your clothes, wrap them in your travel blanket, tie the blanket to your ankle, and swim like a graceful dolphin through the swamp.",
        "result": "damage-major",
        "responseText": "That was painful."
      }
    ]
  },
  {
    "id": "lore_014",
    "text": "After following a set of train tracks for 2 miles, you come across a train station heading to far away lands.",
    "options": [
      { "text": "Blackstaff Tower", "routeTitle": "College_Fjord" },
      {
        "text": "The Forgotten Bard Tree",
        "routeTitle": "The_Bund"
      },
      {
        "text": "Duran's Cliff",
        "routeTitle": "Rio_de_Janeiro"
      },
      { "text": "Oceanside Caverns", "routeTitle": "Great_Barrier_Reef" },
      {
        "text": "No, thank you.",
        "result": "none",
        "responseText": "THE SCROLL DEALER: Be careful out there..."
      }
    ]
  },
  {
    "id": "lore_015",
    "text": "You find a dusty old chest hidden beneath a gnarled tree root. It looks untouched for centuries.",
    "options": [
      {
        "text": "Open the chest carefully.",
        "responseText": "The chest creaks open, revealing a small pouch of gold.",
        "result": "item",
        "details": "gold",
        "amount": 15
      },
      {
        "text": "Open the chest in a fit of rage.",
        "responseText": "The chest violently opens, revealing a small pouch of gold.",
        "result": "item",
        "details": "gold",
        "amount": 15
      },
      {
        "text": "Leave the chest, it might be cursed.",
        "responseText": "You decide against opening the chest and move on.",
        "result": "none"
      },
      {
        "text": "Punch the chest",
        "result": "damage",
        "responseText": "You decide to punch the chest for some reason."
      }
    ]
  },
  {
    "id": "lore_016",
    "text": "You find a wooden box sitting in the mud. Inside the box, you find 6 masks. Outside of each mask, dawning a letter on the forehead, you notice the masks are otherwise featureless. Each mask has a different letter: F, P, W, R, C, and S.",
    "options": [
      {
        "text": "Put on the F mask.",
        "result": "item",
        "details": "weapon",
        "responseText": "You feel power flowing through your veins."
      },
      {
        "text": "Put on the P mask.",
        "result": "item",
        "details": "shield",
        "responseText": "You feel safer and ready for any attack."
      },
      {
        "text": "Put on the W mask.",
        "responseText": "You feel more confident that you will win this fight.",
        "result": "special",
        "details": "recover",
        "amount": 1
      },
      {
        "text": "Put on the R mask.",
        "responseText": "You feel richer than ever.",
        "result": "item",
        "details": "gold",
        "amount": 20
      },
      {
        "text": "Put on the C mask.",
        "result": "item",
        "details": "health-major",
        "responseText": "You feel healthier than ever."
      },
      {
        "text": "Put on the S mask.",
        "result": "item",
        "details": "health-major",
        "responseText": "You feel healthier than ever."
      }
    ]
  },
  {
    "id": "lore_017",
    "text": "You come across a tavern that seems to be bustling with life. As you walk in, you see several patrons drinking and yelling in excitement. They appear to be surrounded by something called Tymora’s Spinner. You ask one patron what is going on and they say 'I have lost 10 times in a row on this stupid game. Here, have my last gold piece. See if your luck is better than mine.' You accept the gold piece. After watching a couple of rounds, it appears you can spend 1 gold piece to bet on a range of numbers and if the ball lands in that range, you win.",
    "options": [
      {
        "text": "Bet the gold piece on range 1-10",
        "responseText": "You lost.",
        "result": "item",
        "details": "gold",
        "amount": 0
      },
      {
        "text": "Bet the gold piece on range 11-20",
        "responseText": "You lost.",
        "result": "item",
        "details": "gold",
        "amount": 0
      },
      {
        "text": "Bet the gold piece on range 21-30",
        "responseText": "You lost.",
        "result": "item",
        "details": "gold",
        "amount": 0
      },
      {
        "text": "Bet the gold piece on range 31-40",
        "responseText": "You lost.",
        "result": "item",
        "details": "gold",
        "amount": 0
      },
      {
        "text": "Bet the gold piece on range 41-50",
        "responseText": "You lost.",
        "result": "item",
        "details": "gold",
        "amount": 0
      },
      {
        "text": "Bet the gold piece on range 51-60",
        "responseText": "You win!",
        "result": "item",
        "details": "gold",
        "amount": 50
      },
      {
        "text": "Bet the gold piece on range 61-70",
        "responseText": "You lost.",
        "result": "item",
        "details": "gold",
        "amount": 0
      },
      {
        "text": "Bet the gold piece on range 71-80",
        "responseText": "You lost.",
        "result": "item",
        "details": "gold",
        "amount": 0
      },
      {
        "text": "Bet the gold piece on range 81-90",
        "responseText": "You lost.",
        "result": "item",
        "details": "gold",
        "amount": 0
      },
      {
        "text": "Bet the gold piece on range 91-100",
        "responseText": "You lost.",
        "result": "item",
        "details": "gold",
        "amount": 0
      },
      {
        "text": "Don't bet. Keep the gold piece and leave the tavern.",
        "responseText": "'I can't leave my life up to chance.'",
        "result": "item",
        "details": "gold",
        "amount": 1
      }
    ]
  },
  {
    "id": "lore_018",
    "text": "There appears to be a stone block with a hole carved into it. The hole appears to be worn away while the rest of the block seems to be smooth. While staring at the block, you hear the sound of a voice that shouts 'Halt, trespasser! If you come any closer, you better tell me how fast you want to die!'",
    "options": [
      {
        "text": "Test the voice and take one small step forward.",
        "result": "item",
        "details": "poison",
        "amount": 10,
        "damage": 1,
        "responseText": "The voice shouts 'I warned you!' and spits a small dose of poison from the hole in the stone block."
      },
      {
        "text": "Decide the voice is bluffing and start running toward the stone block with your weapon.",
        "result": "item",
        "details": "poison",
        "amount": 10,
        "damage": 2,
        "responseText": "The voice shouts 'I warned you!' and spits a medium dose of poison from the hole in the stone block."
      },
      {
        "text": "'Oh yeah? What are you going to do... spit a large dose of poison from that hole in the stone block?'",
        "result": "item",
        "details": "poison",
        "amount": 15,
        "damage": 2,
        "responseText": "The voice spits a large dose of poison from the hole in the stone block."
      },
      {
        "text": "Turn around and walk away.",
        "result": "none",
        "responseText": "The voice yells 'Yeah, you better walk away!'"
      }
    ]
  },
  {
    "id": "lore_020_wizards_tower",
    "dialogueNodes": {
      "start": {
        "text": "Before you stands an ominous wizard's tower, its stone weathered and ancient. Rumors whisper that the wizard who once lived here was slain, and now a monstrous entity inhabits its halls. The monster refuses to leave and the nearby town fears it.",
        "options": [
          {
            "text": "Open the main entrance.",
            "flow": "dialogue_branch",
            "next_node_id": "main_entrance"
          },
          {
            "text": "Search for a less obvious way in.",
            "flow": "dialogue_branch",
            "next_node_id": "hidden_entry_search"
          },
          {
            "text": "Decide it's too dangerous and leave.",
            "flow": "close_encounter",
            "responseText": "Maybe someone else can kill the monster..."
          }
        ]
      },
      "main_entrance": {
        "text": "The heavy oak doors are slightly ajar, revealing a dark, dusty foyer. A faint, metallic scent hangs in the air.",
        "options": [
          {
            "text": "Step cautiously into the foyer, trying to make not even a footstep apparent.",
            "flow": "dialogue_branch",
            "next_node_id": "foyer"
          },
          {
            "text": "Push the doors wide open and announce your presence.",
            "result": "mini_boss_combat",
            "responseText": "The monster announces their presence as well with a loud growl..."
          },
          {
            "text": "Reconsider and look for another way in.",
            "flow": "dialogue_branch",
            "next_node_id": "hidden_entry_search"
          }
        ]
      },
      "hidden_entry_search": {
        "text": "You circle the tower, examining its crumbling walls. Near the back, you find a small, overgrown service entrance, almost completely hidden by ivy. It looks less used, but potentially unstable.",
        "options": [
          {
            "text": "Try the service entrance.",
            "flow": "dialogue_branch",
            "next_node_id": "service_entrance"
          },
          {
            "text": "Go back to the main entrance.",
            "flow": "dialogue_branch",
            "next_node_id": "main_entrance"
          }
        ]
      },
      "service_entrance": {
        "text": "The service door creaks open with surprising ease. Inside, a narrow, dimly lit corridor stretches before you. You notice a glimmer in a shadowy corner.",
        "options": [
          {
            "text": "Investigate the glimmer.",
            "effect": "item",
            "details": "gold",
            "amount": 40,
            "responseText": "You find a small pouch dropped by a previous visitor, containing 40 gold pieces. You continue on...",
            "flow": "dialogue_branch",
            "next_node_id": "foyer"
          },
          {
            "text": "Proceed down the corridor.",
            "flow": "dialogue_branch",
            "next_node_id": "foyer"
          }
        ]
      },
      "foyer": {
        "text": "The foyer is grand but decaying. A majestic, spiraling staircase dominates the center, and two dark corridors lead off to the left and right.",
        "options": [
          {
            "text": "Ascend the grand staircase.",
            "flow": "dialogue_branch",
            "next_node_id": "grand_staircase"
          },
          {
            "text": "Take the left corridor.",
            "flow": "dialogue_branch",
            "next_node_id": "left_corridor"
          },
          {
            "text": "Take the right corridor.",
            "flow": "dialogue_branch",
            "next_node_id": "right_corridor"
          }
        ]
      },
      "grand_staircase": {
        "text": "The stairs creak under your weight, echoing loudly. Halfway up, a trap unsprings and you see a dozen nails flying in your direction.",
        "options": [
          {
            "text": "Quickly dodge the nail trap.",
            "effect": "damage-minor",
            "amount": 3,
            "responseText": "You manage to avoid the worst, but a nail grazes your arm. You take 3 damage. You continue on.",
            "flow": "dialogue_branch",
            "next_node_id": "top_of_tower"
          },
          {
            "text": "Tank the nail trap.",
            "flow": "dialogue_branch",
            "effect": "damage-minor",
            "amount": 10,
            "responseText": "You tank the nails and a few get stuck in your skin. You take 10 damage. You continue on.",
            "next_node_id": "top_of_tower"
          }
        ]
      },
      "left_corridor": {
        "text": "This corridor is lined with empty shelves and overturned furniture. It smells faintly of dust and something sweet. You spot a discarded vial on the floor.",
        "options": [
          {
            "text": "Pick up the vial.",
            "effect": "inventoryItem",
            "id": "health_potion_consumable",
            "responseText": "You pick up the vial. It's a Health Potion. A lucky find. You continue on.",
            "flow": "dialogue_branch",
            "next_node_id": "dead_end_left"
          },
          {
            "text": "Continue to the end of the corridor.",
            "flow": "dialogue_branch",
            "next_node_id": "dead_end_left"
          }
        ]
      },
      "right_corridor": {
        "text": "This corridor is surprisingly well-maintained, adorned with faded tapestries. The air here is colder, and you hear a faint, guttural growl from deeper within.",
        "options": [
          {
            "text": "Follow the growling sound.",
            "flow": "dialogue_branch",
            "next_node_id": "monster_lair_approach"
          },
          {
            "text": "Return to the foyer.",
            "flow": "dialogue_branch",
            "next_node_id": "foyer"
          }
        ]
      },
      "dead_end_left": {
        "text": "The corridor ends abruptly at a solid, unyielding wall. There's no way forward here.",
        "options": [
          {
            "text": "Return to the foyer.",
            "flow": "dialogue_branch",
            "next_node_id": "foyer"
          }
        ]
      },
      "monster_lair_approach": {
        "text": "The growling grows louder, echoing from a large, ornate door at the end of the corridor.",
        "options": [
          {
            "text": "Brace yourself and open the door.",
            "result": "mini_boss_combat",
            "responseText": "The monster announces their presence by emitting an ear piercing growl."
          },
          {
            "text": "Hesitate and return to the foyer.",
            "flow": "dialogue_branch",
            "next_node_id": "foyer"
          }
        ]
      },
      "top_of_tower": {
        "text": "You reach the top floor. The wizard's study is here, filled with arcane instruments and dusty tomes. A strange, pulsating orb floats in the center of the room.",
        "options": [
          {
            "text": "Confront the pulsating orb.",
            "result": "mini_boss_combat",
            "responseText": "The orb flares brightly, revealing its true, monstrous form."
          },
          {
            "text": "Search the study for clues.",
            "effect": "item",
            "details": "gold",
            "amount": 30,
            "responseText": "You quickly search the study, finding a hidden stash of gold beneath a loose floorboard.",
            "flow": "dialogue_branch",
            "next_node_id": "top_of_tower_search_outcome"
          },
          {
            "text": "Descend the stairs and leave the tower.",
            "flow": "close_encounter",
            "responseText": "You decide the top floor is too dangerous for now. You carefully descend and leave the tower."
          }
        ]
      },
      "top_of_tower_search_outcome": {
        "text": "You've found some gold! What do you do next?",
        "options": [
          {
            "text": "Confront the pulsating orb.",
            "result": "mini_boss_combat",
            "responseText": "The orb flares brightly, revealing its true, monstrous form."
          },
          {
            "text": "Descend the stairs and leave the tower.",
            "flow": "close_encounter",
            "responseText": "You decide the top floor is too dangerous for now. You carefully descend and leave the tower."
          }
        ]
      }
    }
  }
]
